[UNK]
[CLS]
[SEP]
[MASK]
[PAD]
<pad>
<unk>
<eos>
<sos>
<mask>
cjmp_REL
jmp_REL
call_NUM
1
mov_rax_qword_SBP
16
cmp_eax_NUM
24
mov_eax_NUM
32
mov_rax_qword_MEM
40
mov_esi_NUM
0
mov_ecx_NUM
48
xor_eax_eax
mov_qword_SBP_rax
cmp_ecx_NUM
10
mov_rax_qword_SSP
56
ret
64
mov_eax_dword_MEM
mov_edx_NUM
mov_eax_dword_SBP
and_eax_NUM
mov_ecx_dword_MEM
mov_qword_SSP_rax
mov_rcx_qword_SBP
test_eax_eax
72
mov_rdi_qword_SBP
cmp_dword_MEM_NUM
mov_edi_NUM
test_al_NUM
mov_rdi_rbx
mov_rdi_rax
8
80
mov_rcx_qword_MEM
add_rsp_NUM
128
push_rbp
pop_rbp
mov_rax_NUM
mov_edx_eax
88
pop_rbx
2
sete_al
mov_dword_SBP_eax
mov_rdi_qword_MEM
mov_rdx_qword_SBP
4
test_rax_rax
sub_rsp_NUM
mov_rcx_NUM
152
12
mov_qword_MEM_rax
push_rbx
or_al_cl
5
96
lea_rsi_PTR
setl_cl
imul_eax_edx
mov_rcx_qword_SSP
sub_edx_NUM
add_rax_NUM
3
104
sub_eax_NUM
mov_rdx_qword_MEM
pop_r14
mov_dword_SBP_NUM
112
call_qword_MEM
mov_rsi_qword_SBP
push_r14
mov_rdi_r14
pop_r12
test_al_al
20
mov_rdi_qword_SSP
mov_eax_dword_SSP
pop_r15
mov_rdi_rbp
mov_rsi_qword_MEM
push_r12
cmp_rax_NUM
xor_edi_edi
120
push_r15
mov_al_NUM
mov_dword_MEM_NUM
28
mov_rdi_r15
nop_dword_MEM
lea_rax_PTR
mov_rdi_r12
cmp_qword_SBP_NUM
pop_r13
lea_eax_MEM
cmp_qword_MEM_NUM
144
mov_ecx_eax
mov_qword_MEM_NUM
mov_rdx_rax
mov_qword_MEM_rcx
mov_rbp_rsp
mov_dword_SSP_eax
136
mov_qword_SBP_rdi
44
push_r13
xor_ecx_ecx
movzx_eax_byte_MEM
cmove_eax_ecx
xor_edx_edx
36
lea_rax_MEM
mov_rdi_r13
mov_edx_dword_MEM
cmp_byte_MEM_NUM
mov_rsi_qword_SSP
mov_byte_MEM_NUM
mov_qword_SSP_rcx
cmp_dword_SBP_NUM
mov_rax_qword_PTR
cmp_edx_NUM
nop
lea_rdi_MEM
68
movabs_rsi_NUM
160
mov_rdx_qword_SSP
mov_byte_SBP_al
mov_rsi_rbx
and_ecx_NUM
movabs_rax_NUM
lea_rdx_MEM
lea_ecx_MEM
lea_rdi_PTR
imul_eax_ecx
nop_word_cs_MEM
mov_rcx_rax
mov_rsi_rax
mov_qword_SBP_NUM
mov_qword_SBP_rsi
52
xor_esi_esi
184
176
mov_rbx_rax
endbr64
60
168
lea_rsi_MEM
cmp_edi_NUM
lea_rcx_MEM
movabs_rdi_NUM
mov_qword_MEM_rdx
256
mov_dword_MEM_eax
mov_rbx_qword_MEM
15
mov_dword_SSP_NUM
cmp_al_NUM
mov_edx_dword_SBP
add_rcx_NUM
264
push_rax
mov_qword_SBP_rdx
mov_qword_SBP_rcx
add_eax_NUM
192
mov_al_byte_SBP
mov_rsi_r14
6
shl_rax_NUM
mov_ecx_dword_SSP
7
movzx_eax_al
mov_rbx_rdi
movabs_rcx_NUM
mov_byte_SBP_NUM
200
224
mov_ebp_NUM
mov_rsi_rbp
and_al_NUM
test_byte_MEM_NUM
movups_xmmword_MEM_XMM
232
mov_ecx_dword_SBP
mov_rdx_rbx
add_rax_rdx
add_rax_rcx
208
and_edx_NUM
mov_ebx_NUM
add_rbx_NUM
mov_rsi_r15
mov_rsi_r12
216
add_rdi_NUM
lea_edx_MEM
cmp_qword_SSP_NUM
lea_rcx_PTR
lea_rdx_PTR
mov_eax_ecx
test_ecx_ecx
mov_dword_MEM_ecx
76
mov_rbx_qword_SSP
movzx_edx_byte_MEM
test_rbx_rbx
test_cl_NUM
100
xor_ebx_ebx
cmp_rdi_NUM
cmp_dword_SSP_NUM
mov_rbp_qword_MEM
add_rdx_NUM
cmp_rax_rcx
xor_ebp_ebp
84
92
mov_rbp_rax
setne_al
mov_rbp_qword_SSP
test_rdi_rdi
add_rsi_NUM
movabs_rdx_NUM
mov_rsi_r13
cmp_esi_NUM
call_rcx
cmp_rax_qword_SBP
mov_dword_SSP_ecx
cmp_ebp_NUM
240
mov_rcx_qword_PTR
cmovne_eax_ecx
sub_rax_NUM
imul_ecx_eax
mov_edi_dword_MEM
mov_r8d_NUM
mov_esi_dword_MEM
mov_rdx_r12
248
mov_rdx_r14
movzx_ecx_byte_MEM
255
lea_rdi_SSP
test_rdx_rdx
mov_rdi_qword_PTR
108
sete_cl
lea_rdi_SBP
mov_r12_rax
mov_edx_dword_SSP
9
mov_r12d_NUM
mov_edx_ecx
movaps_xmmword_SSP_XMM
mov_qword_SSP_NUM
setl_al
test_dl_NUM
nop_word_MEM
17
mov_qword_SSP_rdx
mov_rdx_r15
jmp_NUM
mov_r8_qword_SBP
cmp_byte_SSP_NUM
mov_rsi_rdx
11
cmp_ebx_NUM
cmovl_eax_ecx
sub_rax_rcx
116
mov_rdx_rbp
63
xor_eax_NUM
shr_rax_NUM
13
xor_r12d_r12d
mov_r14_rax
14
mov_qword_PTR_rax
call_rax
cdqe
272
lea_rsi_SSP
test_edx_edx
288
mov_r8_qword_MEM
mov_rsi_rcx
280
mov_eax_dword_PTR
mov_rcx_rbx
mov_r14_qword_MEM
test_rcx_rcx
mov_r15_rax
mov_qword_SSP_rsi
mov_r14_rdi
cmp_byte_PTR_NUM
mov_r14_qword_SSP
mov_rbx_rsi
xor_r14d_r14d
test_rsi_rsi
test_rbp_rbp
cmp_rcx_rax
mov_qword_MEM_rsi
mov_r12_qword_MEM
mov_r14d_NUM
mov_rdx_r13
mov_r15_qword_SSP
add_rbp_NUM
xor_r15d_r15d
mov_r15d_NUM
124
add_ecx_NUM
shl_rcx_NUM
mov_qword_SSP_rdi
mov_r12_qword_SSP
mov_rax_rdx
mov_r13d_NUM
cmp_rax_qword_MEM
mov_r8_qword_SSP
132
lea_rax_SBP
mov_byte_MEM_al
mov_dword_MEM_edx
25
xor_r13d_r13d
mov_r13_rax
mov_r13_qword_SSP
mov_r15_qword_MEM
mov_qword_MEM_rbx
mov_rdx_NUM
xor_ecx_NUM
mov_edi_eax
mov_esi_dword_SBP
mov_qword_SSP_rbx
mov_rax_qword_fs_MEM
mov_r14_rsi
320
mov_dword_PTR_NUM
mov_rax_rsp
mov_byte_SSP_NUM
mov_rcx_r12
mov_rax_rbx
mov_al_byte_MEM
lea_rax_SSP
cmp_dword_PTR_NUM
296
cmp_rdx_NUM
140
mov_rax_rcx
add_r14_NUM
imul_ecx_edx
or_eax_NUM
sete_dl
304
shl_rdx_NUM
mov_r13_qword_MEM
31
mov_esi_eax
xor_edx_NUM
cmp_rcx_NUM
mov_dword_SSP_edx
test_r14_r14
lea_rdx_SSP
lea_rbx_MEM
sub_rcx_NUM
mov_eax_ebp
mov_esi_dword_SSP
mov_qword_SSP_rbp
movzx_eax_byte_SBP
test_r12_r12
19
mov_rbp_rdi
336
mov_dword_SBP_ecx
mov_eax_eax
leave
888
movups_XMM_xmmword_MEM
mov_rsp_rax
344
xor_r8d_r8d
movzx_eax_word_MEM
mov_byte_SSP_al
lea_rsi_SBP
test_cl_cl
mov_rcx_r14
328
cmp_cl_NUM
18
312
test_r15_r15
mov_r9_qword_SSP
add_r12_NUM
mov_ebp_eax
cmp_r14d_NUM
add_r15_NUM
mov_rcx_rdx
cmp_r15d_NUM
movzx_eax_byte_SSP
mov_r9_qword_SBP
512
cmp_r12d_NUM
mov_rcx_r15
30
shr_eax_NUM
mov_rsi_qword_PTR
41
mov_r9d_NUM
lea_rdx_SBP
cmp_rdx_rax
47
cmove_ecx_eax
add_rax_qword_SBP
lea_rcx_SSP
imul_edx_ecx
mov_rbx_qword_SBP
mov_edi_dword_SSP
mov_r15_rdi
mov_ebx_eax
mov_qword_SSP_r8
23
mov_eax_ebx
mov_qword_MEM_rbp
lea_rbp_MEM
mov_dword_SBP_edx
add_r13_NUM
movsxd_rax_dword_MEM
and_rax_NUM
26
46
400
mov_rdi_rcx
mov_qword_MEM_rdi
mov_ecx_edx
352
and_esi_NUM
34
mov_rcx_r13
sub_rcx_rax
add_rax_qword_MEM
movsx_eax_byte_MEM
mov_rdx_qword_PTR
shl_eax_NUM
call_REL
21
test_r13_r13
test_ebp_ebp
cmp_dl_NUM
27
test_esi_esi
45
148
33
mov_qword_SSP_r14
mov_rcx_rbp
mov_byte_MEM_cl
mov_r14_rdx
mov_qword_SSP_r15
call_rbx
add_rcx_rdx
add_edx_NUM
mov_rdx_rcx
mov_rdi_rsi
mov_r12_rdi
mov_r9_qword_MEM
mov_edi_dword_SBP
call_qword_PTR
360
cmovb_eax_ecx
384
22
mov_byte_PTR_NUM
lea_esi_MEM
cmp_r13d_NUM
add_rcx_rax
mov_edx_ebp
sub_rcx_rdx
mov_rbx_rdx
172
164
mov_eax_edx
mov_qword_SSP_r12
mov_r15_rsi
test_byte_SBP_NUM
mov_qword_MEM_r14
392
376
movzx_eax_ax
or_ecx_NUM
mov_qword_SSP_r13
mov_cl_byte_MEM
xorps_XMM_XMM
mov_byte_MEM_dl
mov_rax_r12
408
cmp_ax_NUM
mov_qword_SBP_r8
imul_edx_eax
368
and_cl_NUM
mov_qword_MEM_r12
156
424
lea_r15_MEM
mov_r8_rbx
cmp_rbx_NUM
mov_r12_rsi
mov_qword_SSP_r9
lea_rcx_SBP
shr_ecx_NUM
xor_rax_qword_fs_MEM
mov_rbp_rsi
1024
43
lea_r12_MEM
add_rdx_rax
test_dl_dl
and_eax_ecx
mov_ebp_dword_MEM
mov_esi_ebp
mov_rdi_rdx
mov_edx_ebx
test_ebx_ebx
mov_esi_ebx
180
cmp_qword_SBP_rax
cmp_byte_SBP_NUM
mov_qword_MEM_r8
mov_r12_NUM
58
mov_dword_SBP_esi
shl_rsi_NUM
mov_r8_rax
mov_r15_NUM
mov_word_MEM_NUM
lea_r14_MEM
416
call_qword_SBP
mov_ebp_dword_SSP
shr_rdx_NUM
mov_rdi_rsp
mov_esi_ecx
cmp_rax_rdx
mov_r10_qword_SSP
mov_qword_MEM_r15
mov_rax_r14
mov_esi_edx
not_eax
mov_eax_r12d
127
464
add_qword_SBP_NUM
add_qword_MEM_NUM
mov_r8d_dword_MEM
xor_r9d_r9d
mov_rcx_rsp
shr_rcx_NUM
mov_rdx_rsp
sub_rdx_rax
mov_edx_r12d
movzx_esi_byte_MEM
shr_edx_NUM
lea_r13_MEM
1280
mov_ebx_dword_MEM
432
or_eax_ecx
mov_edx_r14d
448
setne_cl
mov_ecx_ebp
call_rbp
cmp_r8d_NUM
mov_r12d_eax
movzx_edx_ax
cmp_rsi_NUM
cmp_bl_NUM
mov_rax_rsi
sub_rax_qword_SBP
808
pxor_XMM_XMM
37
add_rax_qword_SSP
sub_rax_rdx
cmp_rax_qword_SSP
mov_qword_SBP_r9
440
mov_rsi_rsp
mov_dword_PTR_eax
mov_r13_NUM
mov_r13_rdi
mov_edi_ebp
mov_r14_NUM
mov_rbx_qword_PTR
504
mov_qword_SSP_r10
call_rdx
cmp_eax_dword_SBP
test_bl_bl
movaps_xmmword_SBP_XMM
95
mov_rbp_NUM
mov_ebx_dword_SSP
movsx_ecx_byte_MEM
sub_ecx_NUM
456
mov_r10_qword_SBP
69
movzx_eax_byte_PTR
mov_eax_r14d
test_r12d_r12d
test_edi_edi
50
mov_rax_rbp
mov_edx_r15d
pop_rcx
mov_qword_PTR_NUM
42
mov_r8d_dword_SSP
add_ebp_NUM
mov_ecx_ebx
49
jmp_rax
or_byte_MEM_NUM
65
mov_qword_MEM_r13
movsxd_rcx_dword_SBP
97
mov_r12_rdx
mov_r15_rdx
mov_cl_NUM
lea_r8_SSP
push_NUM
mov_rax_r15
test_r14d_r14d
push_qword_SSP
movzx_ecx_byte_SSP
not_rax
39
488
mov_r12d_dword_SSP
movdqu_XMM_xmmword_MEM
or_eax_edx
mov_dword_SBP_edi
movzx_edi_byte_MEM
rol_eax_NUM
mov_r10_qword_MEM
188
and_edi_NUM
mov_ecx_r15d
mov_edx_r13d
test_r15d_r15d
73
mov_r13_rsi
add_ebx_NUM
29
cmp_eax_dword_MEM
shl_ecx_NUM
mov_dword_SSP_esi
mov_rsi_rdi
196
sub_eax_ecx
212
cmp_r9d_NUM
mov_ecx_r12d
mov_word_MEM_ax
mov_dword_SSP_ebp
mov_eax_r15d
204
mov_rbx_NUM
test_r13d_r13d
38
cmp_rax_rbx
movzx_eax_word_SBP
cmovl_edx_ecx
add_rax_rax
add_eax_ecx
lea_rsp_SBP
mov_r14_qword_SBP
4095
61
mov_r8_r14
mov_eax_r13d
sub_rdx_NUM
mov_rsp_rcx
mov_dword_MEM_esi
cmp_rbx_rax
480
472
mov_rax_rdi
lea_r8_PTR
mov_r8_r12
or_al_dl
xor_rax_NUM
lea_rbp_SSP
call_r8
mov_r15d_dword_SSP
mov_r15d_eax
mov_rax_r13
62
cqo
xor_eax_edx
496
movsxd_rdx_eax
mov_ecx_r14d
lea_rbx_SSP
mov_r14d_eax
add_rsi_rax
not_rcx
or_cl_dl
57
cmp_rbp_NUM
35
mov_qword_MEM_r10
mov_r13d_eax
seta_al
test_sil_NUM
mov_rdx_rsi
mov_rbp_rdx
mov_r9_rax
cmp_rax_rsi
lea_r8_MEM
add_eax_edx
mov_r8_r15
mov_eax_esi
mov_r8d_dword_SBP
add_rcx_qword_MEM
xor_al_NUM
xor_esi_NUM
mov_edi_ebx
add_rbx_rax
520
shl_rdi_NUM
mov_r11_qword_SSP
2048
cmp_qword_PTR_NUM
test_r8d_r8d
cmp_bpl_NUM
and_ebx_NUM
mov_r8d_eax
movzx_ecx_word_MEM
mov_r14d_dword_SSP
mov_r8_r13
cmp_rdx_rsi
mov_dword_MEM_ebp
add_rdi_rax
mov_r13d_dword_SSP
592
mov_r8_rbp
mov_rbx_rcx
not_ecx
movzx_ebx_byte_MEM
mov_r12_qword_SBP
add_r9_NUM
mov_rsp_rdx
test_eax_NUM
xor_rdx_NUM
cmp_rax_r14
66
324
and_ebp_NUM
movsxd_rcx_dword_MEM
add_r8_NUM
add_qword_SBP_rax
cmp_rcx_rdx
jmp_qword_MEM
mov_r13_qword_SBP
584
mov_qword_MEM_r9
mov_r15_qword_SBP
add_rdx_rcx
cmovne_ecx_eax
mov_rsi_NUM
mov_esi_r14d
or_ecx_edx
movzx_edx_byte_SBP
lea_edi_MEM
528
test_byte_SSP_NUM
movzx_ecx_al
movsxd_rax_dword_SBP
mov_r10d_NUM
test_byte_PTR_NUM
cmova_eax_ecx
254
mov_ecx_r13d
mov_bpl_NUM
and_rax_rcx
105
cmp_cx_NUM
544
552
movups_XMM_xmmword_PTR
mov_r13_rdx
call_r12
pop_rax
jmp_rcx
call_r14
mov_r14_rcx
mov_byte_SSP_cl
568
mov_r15d_dword_MEM
cmovl_ecx_eax
mov_r14d_dword_MEM
90
or_edx_NUM
220
cmp_r12_NUM
536
720
81
228
mov_ecx_ecx
test_r8_r8
mov_r9d_dword_SSP
test_bpl_bpl
repe_cmpsb_byte_MEM
movdqa_XMM_xmmword_PTR
rol_ecx_NUM
lea_r12_PTR
mov_ecx_dword_PTR
mov_ebp_esi
cmp_rax_rbp
648
setne_dl
mov_r12d_dword_MEM
movzx_edx_word_MEM
mov_dword_SSP_ebx
mov_edx_dword_PTR
sub_ecx_eax
560
shl_edx_NUM
mov_esi_r12d
576
movsxd_rcx_ecx
mov_esi_r15d
and_dl_NUM
add_esi_NUM
movzx_edx_al
cmove_rax_rcx
call_r13
mov_byte_SBP_cl
movdqu_xmmword_MEM_XMM
sete_bl
and_r8d_NUM
shr_al_NUM
lea_r15_SSP
70
608
mov_rbx_r12
mov_r9_rbx
sar_rax_NUM
lea_r14_SSP
mov_esi_r13d
mov_rdi_r8
mov_r13d_dword_MEM
640
mov_ecx_esi
mov_rdx_rdi
mov_r9d_dword_MEM
call_r15
cmp_r11d_NUM
mov_edx_esi
mov_dword_MEM_ebx
59
cmp_r12b_NUM
600
mov_qword_SSP_r11
movsxd_rax_dword_SSP
lea_r13_SSP
not_rdx
lea_r12_SSP
or_rcx_rdx
mov_ecx_edi
movabs_r8_NUM
113
cmp_eax_ecx
cmp_rax_r15
mov_rcx_rsi
or_cl_al
cmp_r13_NUM
mov_rsi_r8
mov_eax_edi
add_dword_SBP_NUM
mov_r15_rcx
mov_rbx_r13
244
mov_dl_byte_MEM
mov_edi_esi
sar_eax_NUM
movsx_edx_byte_MEM
99
cmp_r14_NUM
624
cmp_rcx_qword_MEM
div_rcx
mov_word_SBP_ax
252
movzx_r8d_byte_MEM
292
shr_rsi_NUM
add_r12d_NUM
672
mov_qword_SBP_rbx
1032
setb_al
mov_bl_NUM
89
mov_r13_rbx
neg_rax
movsxd_rcx_eax
cmp_qword_MEM_rax
688
movzx_ebp_byte_MEM
movzx_ecx_byte_SBP
lea_ebp_MEM
51
rol_rax_NUM
or_rax_rcx
71
mov_dword_SSP_edi
mov_rbp_rcx
add_rdx_rsi
cmp_rsi_rax
mov_r11d_NUM
mov_rdi_r9
or_rax_rdx
lea_rbx_PTR
mov_rbp_rbx
54
lea_r13_PTR
cmp_r8_NUM
xor_eax_ecx
mov_r11_qword_MEM
mov_rbx_r8
shl_rax_cl
mov_r12_rcx
test_bl_NUM
mov_rbx_rbp
movzx_edi_word_MEM
cmp_rdx_rcx
xor_rcx_qword_fs_MEM
712
mov_ebp_edx
mov_r11_qword_SBP
mov_rbx_rsp
616
or_ecx_eax
mov_rax_r8
632
mov_rbp_qword_PTR
and_rsi_NUM
add_r15d_NUM
cmp_r15b_NUM
rol_edx_NUM
and_rcx_NUM
lea_r9_MEM
cmp_r15_NUM
cmp_rbp_rax
xor_rcx_NUM
add_ecx_eax
movdqa_XMM_XMM
mov_rdx_r8
78
movaps_xmmword_MEM_XMM
mov_dl_NUM
mov_qword_PTR_rcx
236
call_qword_SSP
mov_rbx_r14
284
696
sub_rsi_rax
mov_r8_rdi
mov_rbx_r15
mov_ebp_edi
cdq
cmp_r10d_NUM
98
movzx_ecx_cl
add_r14d_NUM
cmp_rax_r12
mov_dword_SSP_r8d
103
mov_edi_ecx
268
680
lea_ebx_MEM
mov_eax_r8d
mov_rsp_rbp
53
lea_r14_PTR
mov_r13_rcx
xor_cl_NUM
mov_rsp_rdi
add_eax_dword_SBP
cmp_rax_rdi
add_edx_eax
mov_word_MEM_cx
not_edx
sbb_al_NUM
add_rsi_qword_MEM
912
656
je_NUM
115
744
664
868
mov_ecx_r8d
or_byte_PTR_NUM
260
add_rdx_qword_MEM
728
mov_r14_r8
276
mov_r9_r14
add_r13d_NUM
or_qword_SSP_NUM
sub_rax_qword_MEM
sub_eax_edx
add_r14_rax
308
neg_eax
setbe_al
movsx_edi_byte_MEM
add_rax_rbx
mov_r9_rbp
add_r12_rax
test_r9_r9
and_ecx_eax
mov_r12_rbx
67
cmp_r14b_NUM
mov_r9d_dword_SBP
93
102
896
imul_rcx_rcx_NUM
107
sub_rdx_rcx
mov_word_SSP_ax
and_rdx_NUM
mov_edi_r14d
704
add_rbp_rax
lea_r9_SSP
add_qword_MEM_rax
lea_r15_PTR
mov_ebx_edx
mov_rbx_r9
movzx_ecx_ax
mov_ebx_edi
cmp_rdx_qword_SBP
sete_sil
768
mov_cl_byte_SBP
904
mov_r14_rsp
cmp_r13_rax
imul_rax_rax_NUM
movups_xmmword_SSP_XMM
316
xor_r10d_r10d
1000
mov_byte_PTR_al
and_ax_NUM
test_r14b_r14b
776
or_rax_NUM
add_r15_rax
mov_dword_SSP_r12d
mov_qword_PTR_rdx
784
mov_r14d_edx
55
mov_r8_rdx
mov_r14_rbx
cmp_r13b_NUM
xor_edi_NUM
mov_dword_SSP_r14d
cmovg_eax_ecx
movzx_edx_dl
add_r10_NUM
test_r12b_r12b
sub_rcx_qword_SBP
lea_rbp_PTR
xor_dl_NUM
xor_edx_eax
sub_edx_eax
sub_rdx_rsi
cmp_word_MEM_NUM
cmp_r12_rax
movzx_r9d_byte_MEM
mov_dword_SSP_r15d
82
cmp_rdx_qword_MEM
mov_edi_edx
mov_rbp_r15
add_dword_MEM_NUM
mov_byte_SBP_dl
movsxd_rdx_edx
bswap_edx
mov_dword_SSP_r13d
mov_esi_dword_PTR
xor_rax_rdx
mov_ebx_esi
mov_rdi_NUM
736
movsxd_rdx_dword_MEM
145
shr_esi_NUM
mov_edi_r12d
shl_rbx_NUM
xor_ecx_edx
setl_dl
repne_scasb_al_byte_MEM
83
paddq_XMM_XMM
119
movzx_eax_word_SSP
mov_r9_r15
114
cmp_rax_r13
332
sub_qword_MEM_NUM
cmp_ecx_eax
mov_cx_word_MEM
test_bpl_NUM
mov_dword_SBP_r8d
sub_rbx_rax
movsxd_rdx_ecx
mov_rsp_rbx
add_edi_NUM
74
mov_dword_MEM_edi
movzx_edx_cl
mov_rbp_r14
test_dword_SSP_NUM
mov_ecx_r9d
mov_rbp_r12
101
cmp_r14_rax
movsd_XMM_qword_PTR
add_rax_rbp
or_edx_eax
cmp_qword_MEM_rcx
add_r13_rax
mov_dword_SSP_r9d
add_r11_NUM
mov_qword_SBP_r14
shl_rdx_cl
sub_rsi_NUM
mov_r10d_dword_SSP
mov_r11d_dword_SSP
mov_r15_rbx
mov_edi_dword_PTR
test_r15b_r15b
test_r9d_r9d
call_r10
mov_rbp_r13
mov_dword_MEM_r14d
mov_edx_edx
mov_edx_edi
300
mov_r15_r13
mov_r9_r12
2880
add_rcx_rsi
109
call_r9
cmovbe_eax_ecx
sub_rax_qword_SSP
mov_r8_rsp
lea_r8_SBP
imul_rcx_qword_SBP_NUM
mov_rsi_r9
and_byte_MEM_NUM
cmove_eax_ebp
mov_r9_rsp
mov_r8d_r14d
setg_al
add_eax_eax
mov_r14_r15
sub_ecx_edx
and_cx_NUM
not_rsi
mov_byte_MEM_bl
mov_rsp_rsi
752
movzx_edx_word_SBP
movsx_eax_byte_SBP
110
rol_esi_NUM
mov_r14b_NUM
movzx_edx_byte_SSP
94
cmp_rcx_qword_SBP
mov_r13_r12
mov_r12_qword_PTR
xor_eax_dword_SBP
imul_esi_ecx
and_ecx_edx
add_rdi_qword_MEM
77
mov_r12d_edx
mov_r8_rcx
mov_qword_MEM_r11
mov_r9d_eax
91
or_al_NUM
mov_edi_r15d
xor_ecx_eax
mov_rcx_rdi
984
mov_r9_r13
mov_r12_rsp
122
85
mov_al_byte_SSP
mov_r15_r14
test_r13b_r13b
mov_qword_PTR_rbx
cmovb_ecx_eax
xor_r11d_r11d
or_edx_ecx
75
mov_rcx_r8
cmp_r15_rax
shr_rax_cl
cmp_sil_NUM
add_rax_rsi
mov_edx_r8d
movsx_eax_al
cmove_rcx_rax
not_esi
253
cmove_rsi_rax
and_r9d_NUM
mov_r10d_dword_MEM
mov_rbp_qword_SBP
792
800
sar_rdx_NUM
129
idiv_rcx
mov_qword_SBP_r11
mov_dword_MEM_r12d
mov_r14_qword_PTR
340
add_ecx_edx
mov_rsp_r9
cmp_dil_NUM
mov_r12_rbp
mov_r12b_NUM
mov_rbp_r8
or_rcx_rax
cmp_rdi_rax
mov_dword_MEM_r15d
1688
106
848
816
79
mov_ebx_ecx
mov_qword_SBP_r10
mov_r12_r14
push_qword_SBP
cmovge_eax_ecx
mov_r15d_edx
356
mov_r12_r15
mov_ebp_ecx
mov_rax_r9
push_r10
cmp_dx_NUM
mov_r14_r12
760
imul_rax_qword_SBP_NUM
mov_rdx_r10
sbb_eax_eax
mov_r12_r13
3232
mov_r15_rbp
mov_r8d_edi
lea_r10_MEM
mov_r15b_NUM
4088
cmp_rcx_rsi
not_rdi
cmp_dword_SBP_eax
shr_rbx_NUM
mov_edi_r13d
117
imul_esi_edx
832
xor_rcx_rax
mov_byte_MEM_sil
movsxd_rdx_dword_SBP
pshufd_XMM_XMM_NUM
movsxd_rax_edx
mov_r13_rbp
mov_r14_r13
mov_dword_SSP_r11d
348
or_cl_NUM
sub_rax_rsi
mov_qword_SBP_r12
257
mov_esi_edi
mov_rcx_r9
setne_byte_SSP
mov_r15_r12
movzx_r12d_byte_MEM
imul_rdx_rdx_NUM
movzx_r14d_byte_MEM
shr_rdi_NUM
cmove_ebp_eax
1248
mov_word_MEM_dx
sub_rcx_rsi
por_XMM_XMM
mov_r13_r15
add_rcx_qword_SBP
mov_r8d_ebx
mov_rdi_r10
lea_eax_SBP
mov_r14_rbp
mov_r15_rsp
setae_al
addsd_XMM_XMM
cmp_eax_dword_SSP
sete_byte_SSP
cmp_edx_eax
movaps_XMM_xmmword_MEM
and_r12d_NUM
div_rsi
sub_rax_rbx
139
mov_r8d_ebp
add_dword_PTR_NUM
imul_edx_esi
mov_dl_al
and_eax_edx
mov_r15_r8
840
lea_r12d_MEM
111
mov_cl_al
and_r13d_NUM
movabs_r9_NUM
test_ax_ax
mov_rdx_r9
sub_rsi_rdx
lea_r8d_MEM
mov_r8d_r12d
add_rsi_rcx
movzx_eax_cl
add_rax_r13
mov_r13_r14
864
and_r15d_NUM
cmp_rsi_rdx
856
87
rol_edi_NUM
mov_r15_qword_PTR
cmp_qword_MEM_rsi
test_dil_NUM
sub_qword_SBP_NUM
mov_r8_NUM
mov_r13b_NUM
121
add_qword_SSP_rax
xor_rax_rcx
mov_rsp_r14
movss_XMM_dword_PTR
mov_eax_r9d
xor_rdx_rax
xor_rcx_rsi
mov_qword_SBP_r15
cmovne_eax_edx
mov_al_byte_PTR
xor_rbx_qword_fs_MEM
add_rsi_rdi
rol_rcx_NUM
add_rcx_qword_SSP
126
mov_dword_PTR_ecx
mov_qword_SBP_r13
cmovae_eax_ecx
mov_r14d_esi
cmp_rbp_rbx
86
or_rdx_rax
cmove_eax_r12d
880
sub_rdi_rax
cmove_ecx_edx
125
and_r14d_NUM
mov_r12_r8
movzx_r13d_byte_MEM
mov_dl_byte_SBP
mov_rax_r10
mov_r8d_r15d
mov_ax_word_MEM
setl_bl
movzx_r15d_byte_MEM
test_ecx_eax
mov_dword_SSP_r10d
movaps_XMM_xmmword_PTR
cmp_ecx_dword_MEM
388
cmove_eax_r13d
cmp_word_SSP_NUM
shl_rbp_NUM
add_r8d_NUM
or_edx_esi
mov_ebx_ebp
mov_r13_rsp
mov_esi_r8d
and_edx_esi
movabs_rbx_NUM
test_sil_sil
movzx_edx_cx
mov_r13d_edx
test_ecx_NUM
mov_r9_r8
cmovs_eax_ecx
cmp_rbx_rbp
824
pop_rdx
mov_r8d_r13d
364
1712
imul_rax_qword_SBP
or_esi_NUM
mov_r13_r8
and_rcx_rdx
neg_rcx
936
lea_r14d_MEM
xor_rsi_NUM
and_edx_ecx
cmp_qword_MEM_rbx
rol_ax_NUM
sub_eax_dword_SBP
cmove_eax_edx
mov_r12d_ecx
118
mov_ebp_ebx
mov_rbp_r9
1052
mov_rsi_r10
mov_dword_MEM_r13d
872
movsd_XMM_qword_MEM
or_ecx_esi
and_rax_rdx
lea_rbx_SBP
cmp_rbx_r14
neg_ecx
setne_sil
sub_rcx_qword_MEM
or_rdx_rsi
div_qword_SBP
mov_r8_qword_PTR
968
cmp_rbx_r12
and_r8b_NUM
and_rax_qword_SBP
mov_r14_r9
137
mov_edx_r10d
cmp_rbx_r15
and_edx_eax
cmove_eax_r15d
123
cmp_qword_MEM_rdx
920
mov_ecx_r10d
mov_r13_qword_PTR
1023
rol_ebx_NUM
1080
setb_cl
rol_ebp_NUM
xor_edx_esi
mov_dword_MEM_r8d
lea_r13d_MEM
test_r14b_NUM
cmove_rdx_rax
add_rbx_rbp
cmp_rsi_rcx
movzx_ecx_word_SBP
movsxd_rax_dword_PTR
add_rax_r14
shl_eax_cl
396
add_rax_r12
cmove_rbx_rax
mov_r14d_ecx
mov_sil_NUM
or_dword_MEM_NUM
add_qword_SSP_NUM
add_rsi_rdx
mov_rsp_r8
lea_r9_PTR
mov_byte_SSP_dl
movzx_edi_al
mov_r8_rsi
test_r8b_r8b
and_eax_dword_SBP
bswap_eax
shl_edx_cl
mov_r8d_edx
cmove_edx_ecx
lea_r15d_MEM
or_rdx_rcx
mov_r10d_dword_SBP
not_edi
shl_esi_NUM
mov_r12d_edi
mov_r9_NUM
and_rdi_NUM
sar_ecx_NUM
movapd_XMM_XMM
xor_rdx_rcx
sar_rcx_NUM
and_rcx_rax
test_r10d_r10d
sub_edx_ecx
add_rdi_qword_SSP
1040
movzx_esi_word_MEM
ucomisd_XMM_XMM
1128
178
xor_rdi_rax
movups_XMM_xmmword_SBP
3224
mov_r11d_dword_MEM
add_edx_ecx
sub_dword_SBP_NUM
shr_edi_NUM
mov_r15d_ecx
130
258
movabs_r10_NUM
movsd_XMM_qword_SBP
xor_eax_edi
1088
xor_edx_ecx
lea_r11_MEM
mov_eax_r10d
mov_r12d_esi
add_rdi_rbp
add_eax_dword_MEM
punpcklqdq_XMM_XMM
rol_rdx_NUM
141
cmp_rax_qword_PTR
mov_r10_rax
mov_r11_rsp
mov_word_SSP_NUM
mov_rsp_r11
movsxd_rsi_dword_MEM
cmp_rdi_rsi
movups_xmmword_SBP_XMM
372
movsxd_rcx_dword_SSP
sub_rbp_rax
test_r12b_NUM
divsd_XMM_XMM
or_rax_rsi
mov_cl_byte_SSP
div_ecx
cmp_edx_dword_MEM
sub_rsi_rcx
1696
cmp_r12_rbx
cmp_rcx_rbx
1016
mov_edx_r9d
add_rax_r15
251
177
sub_qword_MEM_rax
mulsd_XMM_XMM
shr_rdx_cl
cmovle_eax_ecx
1048
and_bpl_NUM
movabs_rbp_NUM
cmovne_rax_rcx
add_rax_rdi
movsx_esi_byte_MEM
jne_NUM
test_r10_r10
mov_r9_rdx
1064
movsd_XMM_qword_SSP
shr_rbp_NUM
cmp_qword_SSP_rax
movdqa_XMM_xmmword_SSP
movups_XMM_xmmword_SSP
neg_rdx
sub_rax_r12
1136
add_rbx_rcx
add_byte_MEM_al
mov_rdi_r11
xor_rcx_rdx
or_rcx_NUM
lea_r9_SBP
cmp_dword_MEM_eax
976
mov_r12_r9
add_dword_SSP_NUM
cmp_rsp_rdx
movsd_qword_SBP_XMM
add_rbx_qword_MEM
not_ebp
952
2056
shl_rsi_cl
add_dword_SBP_eax
mov_r8d_ecx
mov_rsp_r12
cmp_rbx_r13
and_sil_NUM
380
mov_r15d_esi
mov_rax_r11
test_ebx_NUM
xor_dx_NUM
palignr_XMM_XMM_NUM
add_al_NUM
add_rbp_qword_MEM
movsd_qword_SSP_XMM
138
test_ebp_NUM
mul_rcx
mov_bl_byte_MEM
not_rbx
and_rdx_rax
mov_byte_MEM_bpl
test_r13b_NUM
1168
mov_ecx_r11d
or_bl_al
or_qword_MEM_NUM
928
add_rbp_rbx
add_rdi_rcx
rol_r8d_NUM
mov_rbp_r10
bswap_ecx
mulx_r11_r10_qword_MEM
mov_r13d_ecx
mov_rsi_r11
cmp_rsi_rdi
3220
sete_dil
mov_ebx_r14d
mov_rcx_r10
test_r11d_r11d
movzx_esi_dl
1056
412
992
movdqa_xmmword_MEM_XMM
movaps_XMM_xmmword_SBP
lea_r9d_MEM
or_eax_esi
test_r15b_NUM
imul_rax_rcx
mov_r9d_r15d
764
1008
not_al
not_ebx
247
movss_XMM_dword_MEM
cmp_r15_rbx
shr_ebx_NUM
and_eax_dword_MEM
mov_ebx_dword_SBP
xor_rax_qword_SBP
cmp_qword_MEM_rdi
cmp_rbx_qword_MEM
pand_XMM_XMM
test_dil_dil
mov_rsp_r13
and_rdx_rcx
test_dword_MEM_NUM
mov_dword_SBP_r9d
seta_dl
fstp_xword_MEM
sub_rax_rbp
mul_qword_SBP
223
movss_dword_SBP_XMM
sub_r12_rax
cmp_bp_NUM
944
movsxd_rcx_edx
cmp_r13_rbx
or_rbx_NUM
mov_r9_rcx
add_rdi_r13
cmp_rcx_qword_SSP
shr_cl_NUM
250
sar_edx_NUM
imul_ecx_esi
cmp_rbx_rcx
mov_r13d_r14d
idiv_ecx
movsxd_rax_ecx
mul_rdx
add_rdi_rbx
cmp_rsi_qword_MEM
or_edi_NUM
shr_ebp_NUM
bt_rcx_rax
mov_ebx_r8d
add_rdx_rdx
cmp_qword_MEM_rbp
153
xor_r8d_NUM
add_rcx_rbp
movzx_ecx_word_SSP
add_rbx_qword_SSP
sub_ebx_eax
and_rdx_rsi
mov_r9_rsi
mov_dword_PTR_edx
cmp_r14_rbx
1112
sub_qword_SBP_rax
146
169
1184
sub_rbx_NUM
add_rbp_qword_SSP
1240
ror_rax_NUM
shr_r8d_NUM
mov_ebp_r8d
cmove_eax_r14d
rol_r14d_NUM
161
test_edx_NUM
sub_rdx_qword_MEM
shl_r9_NUM
1160
add_rdx_qword_SSP
cmp_ecx_edx
rol_r9d_NUM
1072
154
mov_rdx_r11
shl_r8_NUM
mov_r8d_esi
mov_rsp_r15
sub_r14_rax
cmp_rbx_rdx
mov_ebp_r14d
1352
movzx_edx_dx
or_rcx_rsi
add_rdi_qword_SBP
1176
420
add_rsi_qword_SSP
shl_r12_NUM
sub_rsi_rdi
not_rbp
add_ebx_eax
cmp_edx_esi
add_rcx_rdi
mov_r15_r9
mov_ebx_r15d
cmp_rbp_r12
sub_rcx_qword_SSP
mov_rbx_r10
mov_byte_SBP_sil
punpckldq_XMM_XMM
neg_edx
404
or_edx_edi
unpckhpd_XMM_XMM
and_bl_NUM
sub_rax_r15
movzx_ecx_cx
sub_rax_r14
mov_ebp_r12d
sub_r15_rax
cmp_bx_NUM
or_edi_r8d
movabs_r11_NUM
test_r9b_r9b
and_byte_PTR_NUM
1432
movabs_r14_NUM
960
setne_bl
movaps_xmmword_PTR_XMM
mov_r10_rsp
239
mov_r10_rbx
mov_r11d_dword_SBP
lea_r14_SBP
movaps_XMM_XMM
push_qword_MEM
adox_r8_qword_MEM
mov_r9d_r14d
not_r8
or_ebp_NUM
cmp_r9_NUM
cmp_word_SBP_NUM
shr_dl_NUM
cmp_rbp_r14
fstp_st(0)
or_dl_bl
cmp_rbp_r13
rol_r10d_NUM
mul_qword_SSP
1104
131
sub_rax_rdi
sub_r13_rax
movzx_r10d_byte_MEM
sete_r8b
add_r12_qword_SSP
add_r9_rax
500
test_r15d_NUM
sub_esi_NUM
movzx_esi_byte_SBP
setne_r8b
add_r13_qword_SSP
cmp_rdx_rdi
sub_rax_r13
mov_ebp_r13d
xor_rsi_rcx
add_qword_MEM_rcx
cmovne_rcx_rax
mov_ebx_r12d
1152
add_rdx_rdi
mov_eax_r11d
idiv_qword_SBP
or_dl_cl
cmp_rdi_rdx
mov_r9_rdi
add_rbx_r13
xor_ecx_esi
cmp_rcx_r14
movsxd_rdi_dword_MEM
add_r9d_NUM
cmove_rdx_rcx
movzx_eax_word_PTR
add_rsi_rbp
mov_rsp_r10
or_cx_NUM
movsd_qword_MEM_XMM
movups_xmmword_PTR_XMM
or_byte_SSP_NUM
cmp_r12w_NUM
add_r15_qword_SSP
lea_r13_SBP
movzx_esi_al
ror_eax_NUM
adcx_r10_r9
and_rbx_rax
rol_r11d_NUM
xor_rdx_rsi
mov_r13d_esi
1144
1224
pop_rsi
cmp_rbp_r15
mov_ebp_r15d
mov_r14d_edi
movq_XMM_qword_MEM
shl_r14_NUM
193
cmp_r15_r14
mov_r13_r9
mov_r9d_ebx
mov_qword_PTR_rsi
194
cmp_eax_edx
movabs_r12_NUM
add_r14_qword_SSP
mov_qword_PTR_rbp
mov_r10_NUM
xor_ebx_NUM
133
436
add_qword_PTR_NUM
508
cmp_r12_r15
movzx_edi_byte_SBP
movzx_edx_word_SSP
and_r9d_edx
cmp_r12_rbp
test_qword_SSP_NUM
191
lea_r12_SBP
sub_rsp_rax
243
cmp_r8b_NUM
movzx_r8d_ax
adcx_r8_r11
mulx_r9_r8_qword_MEM
add_r14_rbx
add_rbx_r12
push_rdi
135
cmovne_ecx_edx
mov_r9d_ebp
or_eax_r9d
259
428
and_r10d_NUM
shl_r13_NUM
cmp_rbp_qword_MEM
or_cl_bl
rol_r12d_NUM
1096
rol_r15d_NUM
cvtsi2sd_XMM_rax
mov_r15d_edi
3296
mov_ebp_dword_PTR
1192
or_dl_al
sub_rdi_rdx
1208
1296
134
249
cmp_qword_MEM_r14
movdqa_xmmword_SSP_XMM
mov_dword_MEM_r10d
1264
mov_r10_r15
cmp_rdx_qword_SSP
mov_r15_r10
movsxd_rcx_dword_PTR
rol_r13d_NUM
mov_dword_MEM_r9d
setge_al
1216
cmp_r12_r13
xor_ecx_r8d
mov_byte_MEM_r14b
mov_r8_r9
mov_dx_NUM
mov_r14d_r8d
rol_rsi_NUM
imul_esi_eax
484
add_r12_rbx
movzx_esi_ax
mov_word_SBP_NUM
adox_r10_qword_MEM
fld_xword_SSP
mov_r9d_r13d
xor_rdi_NUM
cmove_rcx_rsi
mov_r11_rax
test_r11_r11
612
add_rdx_rbp
movzx_ebx_byte_SSP
1232
add_rdx_qword_SBP
sub_eax_dword_MEM
1200
cmovb_rax_rcx
shr_rsi_cl
mov_rcx_r11
185
add_r13_rbx
sub_rdx_rbx
cmp_rsp_rax
sete_bpl
sub_edx_esi
1840
neg_rbx
1304
mov_ebx_dword_PTR
add_eax_dword_SSP
add_rbx_r14
460
cmove_rdi_rax
cmp_rax_r8
movabs_r15_NUM
movss_XMM_dword_SBP
cmove_ecx_ebp
cmp_r10_NUM
add_rdi_rdx
cmp_rbx_qword_SSP
mov_edi_r9d
mov_r9d_ecx
mov_byte_MEM_dil
imul_rax_rdx
rol_dx_NUM
mov_r9d_r12d
sub_rdi_rcx
add_rdi_r15
imul_eax_eax_NUM
xor_eax_esi
shl_r15_NUM
movq_XMM_rax
movsxd_rsi_eax
sub_rdi_rsi
cmp_r15w_NUM
mov_r10d_eax
cmp_rcx_rdi
492
xor_ecx_dword_SBP
cmp_rdx_rbx
mov_edi_r8d
or_ebx_NUM
add_r8_rax
cmp_r13_r12
sub_rbx_rcx
516
add_r15_rbx
movsxd_rax_esi
add_rbx_r15
mov_esi_r9d
pcmpeqd_XMM_XMM
mov_edx_r11d
xor_ebp_NUM
add_rsi_qword_SBP
716
mov_r9d_esi
mov_rbx_r11
or_al_bl
add_rcx_r13
170
sub_rdi_NUM
cvtss2sd_XMM_XMM
201
movzx_edx_byte_PTR
xor_rsi_rax
add_eax_esi
movzx_ebp_ax
setle_al
628
cmp_r13_rbp
movzx_eax_dl
push_r11
fld_xword_SBP
mov_ebx_r13d
209
rol_rdi_NUM
cmp_rcx_rbp
sub_rdx_qword_SSP
movzx_esi_byte_SSP
cmova_eax_r13d
cmove_edx_eax
mov_r14d_r13d
and_rbx_rcx
add_rdi_r12
or_esi_edi
163
add_rbp_rcx
mov_al_cl
1816
652
217
add_r12_rbp
cmp_r14w_NUM
cmp_si_NUM
cmovns_eax_ecx
sub_ebp_eax
cmp_rcx_r15
setb_dl
or_rsi_rdi
sub_rbx_rbp
xor_rsi_qword_fs_MEM
or_rax_qword_SBP
sub_ebx_NUM
mov_r15d_ebp
add_rdi_rsi
cmovne_rdx_rax
add_edx_esi
subpd_XMM_XMM
2000
162
1900
imul_rcx_rax
xor_esi_edx
468
or_esi_eax
add_ecx_dword_MEM
cmp_r12_r14
cmp_r8_rax
mov_r11_rbx
sub_rcx_rdi
idiv_qword_MEM
644
cmp_edx_dword_SBP
mov_r15d_r8d
and_eax_esi
mov_r14d_ebp
sub_rdx_qword_SBP
add_rsi_r13
cmovb_eax_r13d
444
cmovl_ebp_ecx
lea_rbp_SBP
movabs_r13_NUM
or_r8d_r9d
push_rsi
ucomiss_XMM_XMM
cmp_r10b_NUM
cmove_rsi_rdi
cmp_r14_qword_MEM
cmp_r14_r15
movsxd_rax_ebx
test_r13d_NUM
1368
movzx_r9d_byte_SSP
and_al_cl
mov_ebp_r9d
and_rax_qword_MEM
cmp_r14_r12
1720
and_ecx_esi
cmp_r13_r14
mov_r12d_ebp
1904
add_r13_rbp
or_rdx_rdi
test_r14d_NUM
movzx_edi_word_SBP
1912
div_esi
1256
or_esi_edx
xor_r9d_NUM
add_rcx_rbx
imul_eax_esi
push_rcx
push_rdx
142
shr_r8_NUM
xor_ax_NUM
shl_r8d_NUM
1120
cmp_rbp_rcx
1288
mov_r14d_ebx
sub_esi_eax
and_r11d_NUM
cmova_ecx_eax
cmp_qword_MEM_r12
xor_al_cl
pop_rdi
shr_r14_NUM
test_r8b_NUM
add_rsi_rbx
cmp_r15_rbp
mov_byte_SSP_bl
mov_r13d_ebp
movsxd_rsi_dword_SBP
add_r14_qword_MEM
vmovdqa_XMM_xmmword_SBP
imul_eax_r8d
mov_dil_NUM
sar_rsi_NUM
movss_dword_MEM_XMM
test_rcx_rax
165
cmove_ebx_eax
1360
2024
lea_r15_SBP
or_esi_ecx
143
add_cl_NUM
mov_r9d_edi
1312
and_cl_al
cmp_qword_MEM_r15
lea_r10d_MEM
mov_r14d_r9d
cmove_eax_ebx
cmp_rbp_qword_SSP
1504
add_esi_eax
mov_qword_PTR_rdi
add_r8_r9
mov_r15d_r14d
xor_eax_dword_MEM
181
test_esi_NUM
add_r10_rax
addss_XMM_XMM
1025
cmp_edx_ecx
1026
imul_rdx_qword_SBP_NUM
neg_rsi
and_ax_cx
cmovl_esi_ecx
shl_rdi_cl
add_r14_rbp
mov_byte_MEM_r12b
mov_esi_esi
xorpd_XMM_XMM
cmp_rdi_rcx
1336
mov_r10_rsi
movaps_XMM_xmmword_SSP
cmove_rbp_rax
movsxd_rsi_esi
mov_word_MEM_si
xor_rsi_rdx
1704
476
sbb_dl_NUM
shr_ax_NUM
mov_r9_qword_PTR
or_dword_SBP_NUM
mov_cx_ax
mov_r8d_r9d
sub_r8_rax
3360
cmp_rcx_r12
mov_ebx_r9d
mov_r10_rbp
mov_r12d_r15d
mov_r13d_r12d
524
fldz
sub_rdx_rbp
add_r10d_NUM
197
add_r14_rcx
and_rbx_NUM
3600
mov_al_sil
shr_eax_cl
imul_rdx
mov_r13d_r15d
1472
sub_rdx_rdi
cmp_qword_PTR_rax
movzx_edi_byte_SSP
movzx_r8d_byte_SSP
mov_r12d_ebx
seta_cl
sub_eax_dword_SSP
cmp_r14_rbp
mov_r10_rdx
1344
imul_ebp_eax
660
and_rcx_rsi
and_rsi_rdi
cmovl_ecx_edx
mulsd_XMM_qword_PTR
add_esi_ecx
and_rax_rsi
sub_rbx_rdx
xor_rdi_rcx
movsxd_rdi_eax
movzx_ebx_ax
add_r12_qword_MEM
mov_r11_r14
452
1272
1832
add_r11d_NUM
or_rsi_rdx
1400
and_edx_edi
xor_esi_eax
and_rsi_rax
183
and_rax_rdi
1456
1496
sub_r12d_NUM
cmp_r13_qword_MEM
mov_r15d_r13d
1488
shr_r9_NUM
xor_esi_ecx
setne_bpl
cmp_al_byte_MEM
1392
mov_byte_MEM_r8b
shr_r12_NUM
adc_rbp_NUM
add_ecx_esi
add_rbx_rdx
cmp_rbx_rsi
div_qword_MEM
150
263
add_ebp_eax
cmp_rdx_r8
jmp_rdx
sub_rbx_r14
1464
604
add_rdx_rbx
cmova_eax_r14d
cmp_r12_rdx
div_rdi
test_r12d_NUM
195
cmove_rdx_rsi
mov_r12d_r14d
mov_r9d_r8d
sub_rbx_r15
1448
add_r15_rbp
shr_r15_NUM
cmp_rbp_rdx
cmp_dword_MEM_ebp
movd_XMM_eax
mov_r14d_r15d
adc_rax_NUM
add_rdi_r8
241
psrlq_XMM_XMM
sub_rax_r8
add_r15_qword_MEM
and_esi_eax
and_rsi_rdx
cmp_r12_qword_SSP
cmp_ebx_eax
mov_ax_word_SBP
xor_edx_edi
4064
cmp_r14_r13
cmovne_ebp_eax
cmp_r15_r13
lea_r11d_MEM
mov_esi_r10d
psllq_XMM_XMM
1480
199
sub_rsp_rdx
movzx_ebp_word_MEM
movzx_r8d_al
or_eax_dword_SBP
add_r12d_eax
rol_rbp_NUM
cmp_qword_MEM_r13
mov_r14d_dword_SBP
242
or_r14d_NUM
rol_rbx_NUM
xor_rbx_rax
596
mov_r15d_r12d
sub_rbp_NUM
sub_rcx_rbx
movzx_r13d_byte_SSP
setb_bl
xor_cx_NUM
1384
cmp_ecx_dword_SBP
add_r12_rcx
mov_bpl_byte_MEM
add_r13_rcx
adc_r10_NUM
movzx_ebx_word_MEM
pop_r8
cmp_r13_r15
mov_qword_PTR_r12
shr_r9d_NUM
xor_eax_ebx
not_r9
shl_edi_NUM
imul_rcx_qword_SBP
add_ecx_dword_SBP
cmovb_eax_r14d
cmp_r12_rcx
mov_dword_MEM_r11d
xor_rdx_qword_fs_MEM
add_rbp_r13
cmove_rcx_rdi
cmp_eax_dword_PTR
cmp_qword_SSP_rbx
shl_esi_cl
mov_r13d_ebx
movzx_ecx_dl
add_qword_MEM_rdx
movapd_XMM_xmmword_PTR
sub_rbp_rbx
sub_rdi_qword_MEM
511
cmovb_eax_ebp
add_rsi_r14
cmove_r14_rax
1864
1328
cmovne_edx_ecx
xor_ecx_edi
or_rsi_rax
580
cmp_eax_ebp
mov_rbp_r11
or_ebp_eax
588
add_esi_edx
add_r14_r13
cmp_r15_qword_SSP
psrlq_XMM_NUM
cmp_r13_qword_SSP
cvtsi2ss_XMM_rax
171
not_cl
add_r12_r13
cmp_di_NUM
1007
sete_r12b
149
mov_r10_rcx
rep_stosq_qword_MEM_rax
cmp_r15_r12
mov_r15d_ebx
movzx_edi_word_SSP
cmp_r14_qword_SSP
lea_ecx_SBP
setne_dil
test_ah_NUM
add_rax_r8
add_rbp_rdx
cmp_r13w_NUM
mov_r10_r14
sub_rdx_r12
202
and_esi_edx
cmp_eax_ebx
cmp_ebp_eax
movzx_r8d_byte_SBP
or_rdx_NUM
mov_r13d_r8d
add_rbp_r12
cmp_rdi_rbx
mov_r12d_r13d
cmovne_rsi_rax
shl_ebx_NUM
mov_r8d_dword_PTR
and_r10d_esi
fstp_xword_SSP
sub_rbx_r12
mov_r11_rsi
1536
mov_qword_PTR_r14
add_ecx_ecx
and_rsi_rcx
fxch_st(1)
movzx_ebp_byte_SSP
cmovne_rax_rdx
xor_edi_ecx
and_rcx_qword_MEM
cmp_r12_qword_MEM
xor_ebx_eax
cmp_r15_qword_MEM
mov_r12d_r8d
shl_r9d_NUM
532
155
xor_eax_ebp
cmove_rax_rdx
xor_rax_rsi
210
1408
movzx_esi_sil
1320
or_dl_NUM
movsx_edx_byte_SBP
246
add_esi_edi
imul_rax_qword_SSP
mov_r11_NUM
mov_word_SSP_cx
imul_eax_ebp
mov_r14d_r12d
mov_dword_PTR_ebx
684
and_eax_dword_SSP
cmp_rcx_r13
mov_r9d_edx
sub_edi_NUM
idiv_rsi
imul_esi_edi
cmovb_eax_r12d
cmp_rdx_rbp
movdqa_XMM_xmmword_MEM
mov_sil_byte_MEM
or_al_sil
shr_r13_NUM
test_cl_al
186
imul_rdx_rax
shr_r11_NUM
movzx_r14d_byte_SSP
and_rdx_rdi
cmove_rbx_rcx
movsxd_rsi_edx
mov_r14_r11
sub_rbx_r13
cmp_rdx_r12
movsxd_rdx_dword_SSP
add_rcx_r14
and_byte_SBP_NUM
movzx_r12d_byte_SSP
167
paddd_XMM_XMM
add_rdx_r13
mov_r12_r10
cmova_eax_ebp
ja_NUM
lea_r10_PTR
neg_ebx
add_rdi_r14
test_edi_NUM
xor_rax_rdi
cmove_r12d_eax
179
207
cmovl_esi_edx
sub_rdx_r14
xor_eax_dword_SSP
and_rcx_r8
cmova_eax_r15d
add_rbp_r14
cmove_r15d_eax
or_dl_sil
mov_r10_r12
mov_r10d_ecx
add_r12_rdx
movsxd_rsi_ecx
shr_rdi_cl
add_edx_edx
imul_ebx_eax
add_r14_r15
and_rcx_rdi
cmp_r14_rdx
or_ebx_eax
205
2888
add_r12_r14
233
mov_r14_r10
1376
1520
3072
add_r13_qword_MEM
and_eax_ebp
imul_eax_ebx
1768
cmp_r13_rcx
movzx_edi_dil
or_rbx_rax
shl_ebp_NUM
sete_r14b
xor_edi_edx
div_qword_SSP
sub_rdx_r13
add_r15_rcx
shr_r10_NUM
div_rbx
setae_cl
shr_r14d_NUM
sub_rsi_rbx
cmp_r14_rcx
mov_byte_MEM_r13b
mov_r15d_dword_SBP
movzx_r15d_byte_SSP
setg_dl
173
1736
mul_r9
sub_ecx_esi
cmove_rbp_rcx
sub_r12d_eax
182
and_ecx_dword_MEM
cmp_r13_rdx
mov_r8_r10
2496
add_eax_edi
or_ah_NUM
shl_r10_NUM
cmova_eax_r12d
mov_byte_SSP_r9b
sub_rsi_qword_MEM
xor_edi_eax
sub_r12_NUM
1792
221
225
273
xor_rbp_rax
add_rcx_rcx
and_r9b_NUM
mov_cx_NUM
mov_esi_r11d
1500
3200
add_ebp_dword_MEM
ror_rsi_NUM
mov_byte_MEM_r9b
mov_edi_r11d
movzx_eax_bl
movzx_r12d_ax
or_edi_ecx
or_qword_MEM_rax
rol_cx_NUM
imul_rax_qword_MEM
and_esi_edi
movzx_r11d_byte_MEM
572
add_eax_ebx
mov_r8b_NUM
shr_r12d_NUM
movsxd_rbx_ebx
add_edx_edi
cmovne_eax_ebp
cmp_eax_esi
xor_esi_edi
cmovne_edx_eax
cmp_dword_SSP_eax
movzx_ebx_bl
261
262
564
mov_r10_rdi
or_ecx_r10d
or_edi_eax
or_rax_rdi
xor_r10d_NUM
and_r14_rax
add_rax_rsp
mul_rsi
xor_cl_al
1528
cmovb_eax_r15d
add_r13d_eax
movzx_r15d_ax
movzx_r9d_ax
cmp_dword_MEM_ecx
cmp_rax_r9
and_dil_NUM
and_r8d_edx
call_r11
add_r15_r14
mov_ebx_r11d
cmp_rdx_r14
mov_cl_byte_PTR
mov_dl_byte_SSP
sete_r15b
xor_bl_NUM
mov_r10d_edi
or_rax_rbx
add_qword_PTR_rax
add_rdx_r8
cmp_rdx_r13
movzx_r13d_ax
add_rcx_r15
218
3221
xor_eax_r8d
add_r14d_eax
movsxd_rdi_edi
sub_rcx_r12
2883
and_esi_ecx
add_r11_rax
mov_byte_MEM_r15b
2936
804
cmp_r9b_NUM
cmove_rbp_rdx
mov_edi_edi
sub_rbx_rdi
divss_XMM_dword_PTR
cmp_qword_SSP_rbp
movss_dword_SSP_XMM
shrd_r8_r9_NUM
sub_rdx_r15
1776
mov_r11_rdx
sub_r8_NUM
pshuflw_XMM_XMM_NUM
and_r9_rdx
comisd_XMM_XMM
mov_r12d_dword_SBP
sub_rcx_rbp
cmp_rdi_qword_MEM
mov_al_dl
movsxd_rax_ebp
cmovl_rax_rcx
mov_r13d_edi
mov_word_PTR_ax
mulss_XMM_dword_PTR
1440
setne_r12b
xor_sil_NUM
548
cmp_qword_SSP_r12
mov_ax_cx
sbb_rax_rax
mov_r14d_dword_PTR
mov_r8d_r10d
sete_r13b
shr_r13d_NUM
test_al_cl
cmp_rsi_rbx
xor_rdi_rdx
166
cmp_r15_rdx
or_rax_qword_SSP
sub_rbp_r15
sub_rbx_rsi
movsxd_rsi_dword_SSP
189
sub_eax_esi
xor_rdi_qword_fs_MEM
2504
add_rsi_r15
movzx_r9d_word_MEM
or_dword_PTR_NUM
shr_rbp_cl
cmp_rbp_rsi
mov_dword_SBP_ebx
movzx_edx_bl
or_edi_esi
setbe_cl
or_rsi_rcx
sub_dword_SBP_eax
xor_rdi_rbp
jmp_r8
neg_rdi
shl_rbp_cl
and_rcx_qword_SBP
bswap_r8d
cmove_r13d_eax
not_r15
ror_edx_NUM
fld_st(0)
xor_edx_dword_SBP
1424
mov_r10d_r15d
movzx_r9d_r8b
1824
add_rcx_r8
cmove_esi_ecx
shr_r15d_NUM
sub_ecx_dword_SBP
147
adc_rcx_NUM
movsxd_rax_r9d
punpcklwd_XMM_XMM
sub_qword_MEM_rcx
xor_ecx_dword_SSP
cmp_rax_r10
or_r15d_NUM
cmove_rcx_rdx
lea_r10_SBP
sete_r9b
sub_ebp_NUM
cmp_r8_rdx
imul_rax_rax
mov_r11d_eax
or_eax_edi
sub_ecx_dword_MEM
and_ecx_edi
cmp_ebp_dword_MEM
inc_rcx
ror_dword_SBP_NUM
2064
and_r8_NUM
cmove_r12_rax
cmp_r15_rcx
mov_byte_SSP_sil
shl_rbx_cl
test_r10b_r10b
add_eax_ebp
sub_r9_rax
sub_rbp_rcx
add_r14_r12
add_r8d_eax
movzx_ecx_byte_PTR
1808
1848
mov_dword_PTR_esi
sub_r13d_NUM
676
movzx_ebx_byte_SBP
shr_cx_NUM
movsx_edx_word_MEM
or_ecx_edi
movq_XMM_rdx
cmove_rbx_rdx
mov_r13d_dword_SBP
vmovdqa_xmmword_SBP_XMM
1512
540
668
lea_edx_SBP
mov_r13_r10
add_ebx_ecx
or_bpl_al
289
cmove_r8_rax
cmp_dword_MEM_edi
sub_eax_ebx
sub_r14d_NUM
700
add_edi_eax
pandn_XMM_XMM
287
or_r8_r9
and_esi_r8d
imul_edi_eax
movsxd_rbx_eax
cmove_rbx_rsi
movzx_ecx_bpl
or_rdi_rsi
and_dl_cl
push_r8
and_rdi_rax
cmovae_rbx_rax
add_r14_rdx
mov_qword_PTR_r15
bsr_rax_qword_SBP
imul_eax_r13d
imul_rcx_rax_NUM
imul_rsi_rsi_NUM
and_r9_NUM
cmovne_rbx_rax
cmp_dl_al
cmp_rdx_r15
231
382
movzx_r14d_ax
add_rax_r9
neg_r15
sub_r8d_NUM
add_rdx_r14
cmp_r8_rcx
fstp_xword_SBP
mov_dword_PTR_edi
mov_r10d_r9d
mulss_XMM_XMM
620
add_r12_r15
imul_eax_r14d
mov_byte_SBP_r8b
add_rbx_rsi
add_rsi_r12
add_edx_dword_MEM
neg_rbp
2956
cmp_rsi_r12
1760
or_rdi_r8
xor_rdx_rdi
add_rdx_r15
punpcklbw_XMM_XMM
sub_rsi_qword_SSP
or_r13d_NUM
1416
1544
222
390
add_rsi_r8
cmp_qword_SSP_r15
cmp_r9_rax
cmp_rcx_r8
movsx_ecx_byte_SBP
and_cl_dl
cmovne_rcx_rdx
1952
or_eax_ebx
or_rax_qword_MEM
sub_r13d_eax
174
not_r13
or_byte_SBP_NUM
setg_cl
sub_r15d_NUM
and_dx_NUM
cmp_eax_r12d
movzx_edi_ax
or_bl_cl
subsd_XMM_XMM
xor_ecx_ebx
mov_byte_SSP_r8b
cmove_r14d_eax
cvtsi2ss_XMM_rcx
mov_r10_r13
1920
513
add_r15d_eax
sub_rsi_rbp
add_rbp_r15
cmp_dword_MEM_edx
imul_rax_rbx
movzx_eax_bpl
neg_r9
or_rcx_rdi
sub_esi_edx
265
imul_edx_edx_NUM
mov_r10_r9
mov_r9b_NUM
movzx_r8d_r8b
or_qword_PTR_NUM
and_rdi_rcx
mov_byte_SSP_r14b
mov_cl_dl
mov_r11d_ecx
mov_r12b_byte_MEM
1568
setne_r13b
xor_edx_r8d
213
add_r15_r13
or_r12d_NUM
test_cx_ax
158
870
cmovne_rdx_rcx
movzx_esi_word_SBP
sar_rbx_NUM
sub_rcx_r15
151
add_r15_r12
movsxd_r8_dword_MEM
and_eax_r12d
and_rax_qword_PTR
cmove_rsi_rdx
mov_r9_r10
add_rcx_r12
or_r14_NUM
or_rax_r9
xor_rcx_rdi
cmp_dword_MEM_esi
imul_eax_r15d
psllq_XMM_NUM
sub_rbx_qword_SSP
238
mov_r11_rbp
movsxd_rbx_dword_MEM
xor_ecx_ebp
movzx_ebx_al
imul_rcx
movdqu_XMM_xmmword_SBP
add_ecx_edi
cmovl_edx_eax
cmovne_ebx_eax
movzx_edx_bpl
packuswb_XMM_XMM
1600
imul_rcx_rdx
setae_dl
shr_rbx_cl
1856
movsx_rdi_word_MEM
movsxd_rbp_ebp
cmovs_ecx_eax
mul_rbx
or_rbx_rcx
test_edx_ecx
157
636
movzx_r10d_byte_SSP
sbb_rbx_NUM
sub_rbp_r12
add_r13_r12
cmove_esi_eax
xor_edi_esi
xor_rsi_rdi
1968
cmp_eax_r15d
2040
push_r9
xor_rdi_rsi
2448
test_r11b_r11b
226
cmove_r15_rax
lea_r11_PTR
mov_r12d_dword_PTR
mov_word_PTR_NUM
movsxd_rax_r12d
298
cmp_rcx_r9
sar_rbp_NUM
xor_edx_dword_SSP
229
3008
add_r15_rdx
movq_qword_MEM_XMM
pop_r9
ror_ecx_NUM
add_r13_r15
cmovl_eax_edx
mov_dx_word_MEM
or_ax_dx
206
and_eax_r15d
mov_byte_SSP_r12b
vpxor_XMM_XMM_XMM
245
movzx_ebp_bpl
or_rdi_rax
159
556
cmp_dword_MEM_ebx
mov_edi_r10d
mov_r10_r8
movsxd_rax_r8d
sub_rdi_r8
1584
198
2928
cmp_eax_r14d
cmp_rsi_rbp
ror_esi_NUM
1576
cmovbe_rax_rcx
lea_r10_SSP
mov_byte_SSP_r13b
xor_rax_r11
movsxd_rax_edi
movzx_eax_sil
1744
740
add_rbx_rbx
movsx_edx_al
movzx_r9d_byte_SBP
1053
1928
377
mov_r10d_edx
neg_r14
cmp_rsi_r14
movzx_edx_sil
sub_rbp_qword_SSP
sub_rcx_r13
xor_rcx_r8
not_r14
sbb_eax_NUM
add_rax_r10
sub_r15d_eax
cmp_dword_PTR_eax
movzx_esi_word_SSP
748
mov_ebx_r10d
ror_rcx_NUM
2144
add_rbp_rsi
and_rax_r8
and_rdi_rbx
setne_r14b
772
add_word_MEM_NUM
mov_r8b_byte_MEM
movzx_r8d_word_MEM
sub_rsi_qword_SBP
xor_eax_r14d
xor_rdi_rbx
692
708
cmove_eax_esi
pop_r10
1872
sub_r12_rbx
and_r12_NUM
dec_rcx
movsx_eax_byte_SSP
2128
sar_rdi_NUM
2072
sub_rbp_rdx
1868
1888
274
and_rdi_rsi
cmovge_ecx_eax
mov_byte_SSP_bpl
xor_ebx_ecx
2080
add_r13_rdx
cmp_r12d_eax
and_eax_ebx
and_ecx_dword_SBP
cmove_rdx_rdi
cmp_r11_NUM
cmp_rax_r11
and_r10d_ecx
sub_r13_NUM
sub_rsi_r12
869
sub_rbp_qword_MEM
2176
movsxd_rax_r14d
add_dword_MEM_eax
and_r14b_NUM
sar_esi_NUM
add_rax_r11
test_r9b_NUM
and_rax_qword_SSP
mov_r11d_r10d
movzx_esi_cl
setl_bpl
add_rsi_rsi
movzx_esi_byte_PTR
imul_edi_esi
mov_ebx_ebx
movsx_esi_byte_SBP
219
321
cmp_rbx_rdi
mov_r13d_r9d
setne_r9b
and_eax_edi
cmp_r8_rsi
mov_r9d_dword_PTR
neg_cl
not_r12
div_r8
sub_eax_edi
cmovne_eax_esi
cmovne_r12d_eax
fucomip_st(1)
imul_ecx_ecx_NUM
sbb_rdx_NUM
sub_rcx_r14
2032
adc_r13_NUM
not_r14d
or_rax_rbp
add_qword_MEM_rbp
cvtsi2sd_XMM_qword_MEM
1752
2256
imul_edi_ecx
shl_r11_NUM
xor_ax_dx
353
and_rax_rbx
2160
div_r15
sub_rbp_r14
sub_rcx_r8
sub_esi_ecx
mov_word_MEM_di
pop_r11
pshufhw_XMM_XMM_NUM
1041
add_ebx_ebx
neg_r13
shrd_r9_r10_NUM
shrd_rbp_r8_NUM
2208
365
mov_r15b_byte_MEM
or_rdi_rdx
test_rax_rcx
and_rax_r9
imul_eax_r12d
mov_r13b_byte_SSP
mov_dword_PTR_ebp
mul_r8
2136
227
adc_r9_rax
cmove_esi_edx
movzx_eax_r8b
bt_ecx_eax
cmp_esi_edx
mov_qword_PTR_r13
mov_r11_r13
sub_r14_NUM
2028
2240
and_dword_MEM_NUM
cmp_qword_SSP_rcx
pcmpeqb_XMM_XMM
sub_rbx_qword_MEM
mov_dword_SBP_r14d
mov_r15d_r9d
xor_rax_r8
269
cmp_qword_SSP_r13
movzx_r12d_word_MEM
sbb_ebx_ebx
and_rax_rbp
and_rdi_r10
cmp_eax_r13d
fstp_st(1)
mov_sil_byte_SBP
movq_XMM_rcx
movsxd_rdx_dword_PTR
movzx_r12d_r12b
test_cx_cx
xor_edx_ebp
cmp_rdi_rbp
imul_edi_edx
jmp_r9
mov_r11_r12
or_eax_ebp
bt_rax_NUM
imul_rsi_qword_SBP_NUM
movsx_ecx_word_MEM
230
322
adc_rbx_NUM
cmovne_eax_r13d
mov_byte_SBP_dil
not_r13d
175
271
sub_r12_r13
sub_r14_rbx
203
add_rax_qword_PTR
and_r15b_NUM
mov_r14b_byte_MEM
movsxd_rdi_dword_SSP
add_r13_r14
add_rcx_r9
cmovns_ecx_eax
cmp_ecx_esi
mov_r11_r10
not_r12d
or_al_byte_SSP
or_eax_dword_SSP
or_rdi_rcx
add_rdx_r12
or_r8d_eax
xor_rax_rbx
add_edi_ecx
cmp_r14d_eax
1784
187
add_r9d_eax
cmp_r13_rsi
mov_r12d_r9d
or_ebp_ecx
xor_eax_r11d
401
and_rdi_r8
vpshufb_XMM_XMM_XMM
xor_ebp_ebx
1284
2047
996
cmp_rsi_r8
movzx_esi_bl
or_edi_edx
sub_r14d_eax
xor_bpl_NUM
xor_ebp_eax
1624
mov_ebp_r10d
and_edi_eax
cmovl_ebx_ecx
add_r9_qword_MEM
1728
756
cmp_ebp_ebx
cmp_rbp_rdi
not_r15d
xor_eax_r12d
892
mov_dword_SBP_r12d
mulss_XMM_dword_MEM
not_r10
ror_edi_NUM
setne_r15b
1800
cmovne_esi_eax
1944
mov_r11_rdi
add_rbx_rdi
and_dl_al
mov_ebp_r11d
movsx_eax_word_MEM
sub_r15_rcx
xor_ebx_edx
xor_edx_ebx
add_edi_edx
and_eax_r8d
cmp_qword_SSP_r14
cvttsd2si_rax_XMM
mov_byte_SSP_r15b
mov_r15d_dword_PTR
movsxd_rdi_dword_SBP
neg_r12
sub_r15_NUM
xor_rcx_r9
1896
imul_rdx_qword_MEM
imul_rdx_rsi
add_qword_MEM_rbx
cmp_r9_r8
movq_XMM_rsi
sub_r15_r12
imul_rdx_rcx
sub_esi_edi
1992
2304
281
rol_dword_SBP_NUM
1057
275
movdqu_xmmword_SSP_XMM
movss_XMM_dword_SSP
sub_edi_eax
sub_r8d_eax
xor_ecx_dword_MEM
1552
cmp_rsi_r15
movsxd_rbp_dword_MEM
imul_eax_dword_MEM
sub_qword_MEM_rdx
xor_eax_r9d
or_r13d_eax
sub_r14_r15
xor_rbx_rcx
267
282
and_ebx_eax
movsx_edi_byte_SBP
1984
mov_r11_r9
or_dl_dil
2016
add_r10d_eax
cmove_rdi_rcx
pmuludq_XMM_XMM
seto_al
sub_r15_rbx
4000
and_rdi_rdx
lea_r11_SSP
setbe_dl
xor_esi_dword_SBP
2976
cmove_rdi_rbx
mov_ebp_ebp
movzx_ecx_bl
movzx_esi_si
sub_r14_rcx
3080
3204
and_ecx_ebp
mov_r11_r15
add_ebx_dword_MEM
imul_rax_rdx_NUM
mov_r10d_r8d
1960
2352
302
movq_rax_XMM
1030
add_ecx_dword_SSP
cmovne_r15d_eax
or_ebx_ecx
1592
1608
211
1976
add_ebp_ecx
and_r12b_NUM
and_rax_r13
cmovl_esi_eax
cmovne_eax_r15d
cmp_r11b_NUM
cvtsi2sd_XMM_rdx
sub_r13_rbx
test_dx_dx
xor_r10_NUM
xor_r15d_NUM
2656
290
or_rbp_rax
sub_rax_qword_PTR
1616
305
cmovae_ecx_eax
mov_r11_r8
imul_rax_r8
mov_r15_r11
movsxd_r12_dword_MEM
shl_al_NUM
add_eax_r14d
cmovb_rbx_rax
xor_r15d_eax
xor_rdi_r14
add_r14d_ecx
add_rbp_rdi
neg_ebp
or_dword_PTR_eax
sub_r12_rcx
sub_r9_NUM
3056
bsf_rcx_qword_SBP
cmp_rdi_r13
sub_rsi_r8
1880
521
cmove_ecx_r12d
or_bl_dl
sub_rbp_r13
299
mov_byte_PTR_dl
or_r14b_al
add_qword_MEM_r15
sub_r13_rbp
2944
fldcw_word_SSP
cmove_ecx_r15d
mov_r11_rcx
not_r8d
seto_dl
cmove_rsi_rcx
lea_edi_SBP
mov_bl_byte_SSP
movsxd_rax_r13d
mulx_r10_r11_qword_MEM
seta_bl
844
add_r8_qword_MEM
add_r8d_ecx
and_rax_r12
imul_rdx_rax_NUM
or_cl_sil
cmove_ecx_esi
cmovl_ebx_eax
mov_byte_SSP_r10b
xor_r8_NUM
313
724
add_r11d_eax
cmovb_eax_edx
mov_word_SBP_cx
or_ax_NUM
sub_r13_r12
and_sil_dl
bswap_ebx
234
and_al_dl
cmovl_ebp_eax
cmp_al_cl
imul_rax_rsi
sub_rdx_r8
add_qword_SSP_rcx
cmovne_rbp_rax
movzx_eax_r12b
setl_r14b
shl_qword_SBP_NUM
add_r15d_dword_MEM
cmp_ebx_dword_MEM
movzx_r14d_word_MEM
xor_eax_r13d
xor_rbx_NUM
and_edi_r8d
and_r8_qword_MEM
cmp_ebx_ebp
comiss_XMM_XMM
fld_xword_MEM
mul_r11
shl_r10d_NUM
sub_cl_al
sub_rsi_r13
xor_ecx_r9d
2272
948
cmp_rbx_r8
1560
and_rax_r14
2912
cmove_edi_eax
cmovne_eax_r12d
cmove_rax_rbx
cmp_dword_MEM_r14d
cmp_dword_MEM_r15d
not_dl
or_rcx_qword_MEM
sbb_cl_NUM
sub_r15_rsi
1680
2008
cmp_r12_rsi
fild_qword_SSP
movsx_edi_al
seto_cl
sub_r10_rax
2192
add_edi_esi
mov_dil_byte_MEM
or_eax_dword_PTR
shl_r8_cl
xor_eax_r10d
cmp_cl_dl
cmp_r14_rsi
movsx_r8d_byte_MEM
ror_rdx_NUM
and_r15_NUM
imul_rdx_r8
neg_r10
not_r9d
or_eax_dword_MEM
or_r8_qword_MEM
1664
2704
and_r13_NUM
and_r8_rdx
bt_qword_MEM_NUM
mov_word_MEM_bx
3048
and_eax_r14d
bswap_rax
imul_rcx_qword_MEM_NUM
movsx_ecx_al
sub_eax_ebp
xor_r13d_NUM
imul_rax_r9
mov_r10d_esi
mov_r13d_dword_PTR
rol_r11_NUM
cmove_ebp_ecx
mov_r13_r11
mul_qword_MEM
xor_r12d_NUM
and_r9d_esi
cmp_r15_rsi
imul_rsi_rax
mov_r10b_NUM
xor_edx_r9d
add_ebp_ebx
add_r8d_edx
and_edi_esi
and_rcx_rbx
cmove_rdx_rbp
cmp_byte_MEM_al
jmp_qword_ds_MEM
xor_ebp_ecx
1037
add_rbx_qword_SBP
cmove_rdi_rbp
shl_r14d_NUM
xor_dil_NUM
4056
cmp_rsi_qword_SSP
rol_r8_NUM
ror_r8d_NUM
cmovne_rsi_rcx
cmp_r10_rax
mov_r12_r11
movsxd_rcx_esi
adc_r9_qword_MEM
add_r12d_ecx
and_ecx_ebx
cmp_qword_PTR_rbx
mulx_rax_rbx_qword_MEM
neg_esi
or_rcx_r10
3160
972
cmp_ecx_dword_SSP
movsx_rsi_byte_MEM
or_sil_NUM
and_r10_rsi
and_rsi_r8
imul_eax_dword_SBP_NUM
mov_r13b_byte_MEM
2224
add_ebp_edx
cmovne_rdi_rax
cmp_ecx_ebp
or_dword_SSP_NUM
or_eax_r8d
or_qword_SBP_rax
sub_r13_rsi
xor_edx_dword_MEM
2360
2600
xor_ebp_edx
337
cmove_ecx_ebx
xor_edi_r8d
xor_rdi_r13
add_ecx_ebp
and_ecx_dword_SSP
xor_cl_dl
xor_ecx_r14d
add_r15d_ecx
and_r14_NUM
cmp_r9_rdx
mov_r9_r11
neg_r8
cmovne_r13d_eax
cmp_esi_eax
cmp_rdx_r9
test_qword_MEM_rax
xor_rax_rbp
add_dl_NUM
and_rbp_NUM
test_bp_bp
add_ebx_edx
add_r9d_ecx
and_edx_dword_MEM
bt_rdx_rcx
imul_r12d_eax
movsxd_r15_dword_MEM
movzx_r8d_cl
sub_rsi_r14
xor_edi_dword_SSP
1020
2112
3184
387
cmp_dl_byte_MEM
cmp_rsi_r13
mov_byte_PTR_cl
mov_r9d_r11d
shr_r10d_NUM
sub_eax_r14d
xor_al_dl
xor_r9_NUM
mov_dword_SBP_r10d
movzx_edi_sil
301
not_r11
xor_ebp_dword_SSP
1051
900
cmp_cl_byte_MEM
mov_r11d_ebx
mov_r8_r11
movsxd_rcx_ebp
movzx_eax_r13b
rol_r13_NUM
1054
3368
imul_edx_edi
or_edx_r10d
shl_r12_cl
and_rdx_rbx
movzx_r13d_word_MEM
sub_rax_r10
2096
2264
bsf_rax_qword_SBP
mov_byte_MEM_r10b
mov_r11d_edx
sar_r14_NUM
sub_r15_rbp
1228
2152
279
and_eax_r13d
movq_XMM_rbx
sub_r14_rsi
add_eax_r8d
add_r13d_ecx
cmp_r13d_eax
cmp_r9_rcx
or_r12b_al
235
mov_byte_MEM_r11b
rol_r9_NUM
xor_ebx_ebp
1632
2248
2480
2584
297
and_edi_ecx
cmovg_ecx_eax
movsxd_r14_dword_MEM
movsxd_rcx_ebx
xor_r14d_NUM
xor_rbp_r14
cmp_rsi_r9
imul_rcx_qword_MEM
imul_rdx_qword_SBP
shl_r9_cl
shr_r14_cl
add_eax_r13d
cmp_qword_SBP_rbx
cmp_rbx_qword_PTR
cmp_rdi_r8
movsx_ebp_byte_MEM
or_r14d_eax
sub_r13_rcx
xor_ebx_esi
xor_rbp_rcx
xor_rdi_r12
add_qword_MEM_r14
cmovne_r12_rax
movsxd_r13_dword_MEM
movsxd_rsi_dword_PTR
2896
movzx_r9d_al
1050
190
3240
796
add_rdi_r9
and_r8d_eax
bswap_edi
cmove_ecx_r13d
cmovl_eax_ebp
cmp_ecx_ebx
cmp_rdi_r12
movsxd_r12_r12d
movsxd_rax_r15d
or_ebx_edx
xor_ebp_edi
xor_ecx_r12d
adc_r10_qword_MEM
adc_r8_qword_MEM
adc_r9_rcx
add_r9_r10
adox_r9_rcx
cmove_r13_rax
cmp_dword_SSP_ebp
mulx_r8_r9_qword_MEM
setb_byte_SSP
shr_edx_cl
sub_ecx_ebx
movsx_esi_byte_SSP
not_r10d
or_rsi_NUM
xor_eax_r15d
2472
and_rax_r15
mov_byte_SSP_dil
mov_r9d_r10d
mov_word_MEM_bp
or_cx_dx
setae_sil
shl_r15d_NUM
sub_edx_edi
test_cl_dl
338
780
820
bswap_esi
cmovne_r14d_eax
sub_r12_rsi
sub_r14_qword_MEM
1028
add_r8_rcx
addsd_XMM_qword_MEM
movzx_r13d_r13b
add_edx_dword_SSP
add_esi_esi
cmovae_rsi_rax
imul_rax_r13
mov_r8d_r8d
sub_r13_qword_SSP
xor_dl_cl
2400
bsf_rcx_qword_SSP
bswap_r9d
ror_rbp_NUM
sub_r8_rcx
sub_rax_r9
xor_ebp_esi
xor_edi_ebp
ucomisd_XMM_qword_PTR
1640
2904
and_edx_r8d
cmove_ecx_r14d
cmp_r8w_NUM
2672
2920
mov_dword_SBP_r15d
or_rdx_rbx
361
add_edx_ebx
div_r12
or_r12d_eax
215
237
add_ecx_ebx
add_rbx_r10
and_rcx_rbp
cmove_edx_esi
setl_r8b
shl_dl_NUM
test_eax_ebp
214
788
mov_r8b_byte_SBP
psrld_XMM_NUM
vmovaps_xmmword_SBP_XMM
xor_ecx_r15d
add_bl_NUM
shl_r12d_NUM
shr_r8_cl
sub_r14_rbp
xor_r10d_edx
1036
357
and_r10b_NUM
and_r9_rbx
cmp_esi_ecx
imul_ecx_edi
sub_rdi_rbx
xor_ebx_dword_MEM
2680
3768
689
mov_r8d_r11d
mov_word_SSP_dx
movzx_ebp_al
or_rbx_rdx
sub_r13_r14
xor_esi_ebp
and_r13b_NUM
movzx_eax_cx
movzx_r12d_al
xor_ecx_r11d
1924
318
imul_eax_edi
movzx_r15d_r15b
xor_r8d_eax
xor_rdi_r15
add_r13d_edx
and_rdx_qword_MEM
cmovb_ecx_edx
cmovl_ebp_edx
mov_dword_PTR_r14d
sbb_edx_edx
xor_esi_ebx
286
345
adc_rdx_NUM
add_edx_ebp
add_r12d_edx
add_r9_r8
add_r9d_edx
cmp_rdi_r14
movsx_edx_byte_SSP
xor_rsi_rbp
2168
cmovne_edi_eax
cvtsi2sd_XMM_eax
imul_rdx_r12
rep_movsq_qword_MEM
sbb_r12_NUM
setge_cl
306
cmovs_ebx_eax
movsx_edi_bl
or_esi_r8d
sub_r15_r14
xor_esi_r9d
794
and_rdx_rbp
sub_r12_rdx
xor_rcx_rbx
277
add_r10d_ecx
bt_rdx_rax
cmove_rax_rsi
or_edx_r8d
or_rax_r12
or_rax_r8
and_eax_dword_PTR
and_ebp_eax
and_rdx_r8
andps_XMM_XMM
bswap_ebp
cmp_r15d_eax
movzx_r8d_byte_PTR
or_bl_NUM
sub_rsi_r15
1031
cmove_r9_rax
cmp_esi_dword_MEM
mov_al_dil
movzx_r15d_word_MEM
or_ebp_edx
xor_edi_ebx
add_eax_r12d
cmova_eax_ebx
cmovb_rbp_rax
cmovb_rcx_rax
fmulp_st(1)
movzx_r8d_word_SBP
shl_edi_cl
sub_edx_ebx
xor_edx_r14d
2088
278
mov_r11d_r14d
xor_r12d_eax
xor_rbx_rdx
2288
270
354
370
514
adc_r11_r8
cmovl_edi_eax
comiss_XMM_xmmword_PTR
mov_r11d_esi
mulx_r12_r13_qword_MEM
1033
2968
and_rbp_rax
cmovne_esi_edx
cmovne_r14_rax
idiv_dword_SBP
mov_r10_r11
1648
2104
2120
2328
291
3192
366
add_r15_rsi
cmovl_ebp_esi
cmp_dl_cl
cmp_ebp_dword_SSP
mov_si_NUM
movsxd_rdx_esi
movzx_ecx_sil
shl_ebx_cl
1076
2368
985
cmp_dword_MEM_r12d
or_ecx_ebx
psubq_XMM_XMM
2232
add_r11_qword_MEM
and_qword_MEM_rax
2049
2424
add_rdx_r9
add_rsi_r9
sub_r14_qword_SSP
sub_r8_rdx
1672
2696
633
and_rax_r10
cmp_r9_rsi
mov_ax_NUM
movsx_ebx_byte_MEM
movzx_r8d_dl
xor_si_NUM
and_r9d_ecx
mov_r14b_byte_SSP
mov_word_MEM_r8w
shl_r14_cl
and_edi_edx
and_r10_rcx
imul_rdi_rax_NUM
mov_r10_qword_PTR
xor_r8d_ecx
2200
and_ecx_r8d
or_esi_dword_SBP
sub_dword_MEM_NUM
xor_esi_r8d
cmp_r8_qword_MEM
mov_r11d_r13d
mov_word_SBP_dx
movsxd_r12_eax
315
imul_rsi_rbx
mov_dl_cl
or_r15b_al
or_rax_r14
ror_rdi_NUM
xor_rax_r12
1993
314
add_qword_MEM_r12
add_r8_rdx
lea_esi_SBP
sbb_rax_NUM
sbb_rsi_qword_SSP
xor_rcx_rbp
3292
cmovb_eax_ebx
cmovne_r8_rax
cmp_r10w_NUM
movzx_ebp_word_SSP
setb_bpl
sub_ecx_dword_SSP
sub_r15_qword_MEM
xor_rax_r14
mov_dword_SBP_r13d
mov_sil_byte_SSP
movzx_edi_bl
movzx_r9d_r9b
sub_r12_r14
add_sil_NUM
cmp_r14d_ebp
sub_r12_r15
2184
add_eax_r15d
add_r13_rsi
add_r9_rdx
and_r11_rdx
and_r9d_eax
cmovae_rbp_rax
vpclmulqdq_XMM_XMM_XMM_NUM
xor_ebx_dword_SSP
xor_ecx_r13d
2816
cmovl_eax_ebx
cmp_r12_rdi
xor_rax_r9
add_eax_r9d
imul_r15d_eax
movsxd_rdx_ebx
sub_r15_qword_SSP
subpd_XMM_xmmword_PTR
1656
1844
1936
2664
add_edx_r9d
and_edx_ebp
bswap_r15d
bswap_rcx
cmp_eax_edi
cmp_r11_rax
inc_rax
movzx_eax_ah
or_r9_r10
xor_r9d_dword_SSP
3216
fld_xword_PTR
2344
666
cmovae_rax_rcx
fld_dword_PTR
movzx_eax_r15b
movzx_edx_r12b
or_rcx_rbx
sub_r12_qword_SSP
sub_r12_rbp
sub_r14_rdx
xor_ebx_edi
cmovne_r13_rax
cmp_ebx_r14d
imul_rax_r12
test_r10b_NUM
1004
add_r10_qword_MEM
and_eax_r9d
cmp_qword_MEM_r8
xor_rax_qword_MEM
266
3000
add_ecx_r8d
and_rax_r11
cmp_dword_SSP_ebx
cmp_r10_r8
shl_ebp_cl
xor_rsi_r11
add_esi_dword_SSP
cmove_rbx_rbp
pslld_XMM_NUM
xor_rax_r10
cmp_rcx_qword_PTR
imul_rax_qword_MEM_NUM
movsxd_r9_dword_MEM
sete_byte_MEM
sub_r9_rdx
sub_r9d_NUM
xor_rbp_rdx
add_r10_rcx
add_r12_rsi
movzx_r14d_r14b
rol_bx_NUM
xor_rbx_rdi
2216
2616
438
515
cmovns_eax_edx
mov_r10d_r14d
movsxd_rbp_eax
movzx_edi_cl
movzx_esi_bpl
mulx_r9_r12_qword_MEM
and_r8w_NUM
movsxd_rcx_r14d
movzx_r9d_word_SBP
sub_r15_rdx
cmovne_r8d_eax
mov_r10d_ebx
mov_r11d_edi
or_bl_sil
sub_r13_r15
sub_r9_r8
test_bx_bx
test_dl_cl
2376
828
add_ebp_dword_SSP
add_edx_dword_SBP
add_r11d_ecx
cmp_r10_rdx
div_r13
mov_byte_SSP_r11b
rol_r12w_NUM
imul_ebx_ecx
ror_r9d_NUM
sar_r8d_NUM
sub_eax_r15d
test_r11b_NUM
xor_edx_r15d
2312
2748
329
add_r9_rcx
cmove_rdx_rbx
cmp_ebx_ecx
cmp_r12d_ebx
div_r14
or_r15d_eax
sub_r13_rdx
sub_r9d_eax
2648
add_edx_r15d
and_edi_r9d
cmp_edx_edi
div_rbp
movzx_eax_dil
or_ecx_ebp
or_r14_rax
sub_ecx_edi
test_r8d_NUM
test_rax_rdx
xor_esi_dword_SSP
737
986
add_r14d_edx
bt_rcx_NUM
cmp_edx_dword_SSP
imul_ecx_ebp
mov_r11d_r9d
neg_r12d
ucomiss_XMM_dword_PTR
cmovne_edx_esi
cmovne_rsi_rdx
cvtsi2sd_XMM_rcx
divsd_XMM_qword_PTR
