[UNK]
[CLS]
[SEP]
[MASK]
[PAD]
<pad>
<unk>
<eos>
<sos>
<mask>
call_NUM
cjmp_REL
mov_rax_qword_SBP
0
jmp_REL
mov_rdi_rax
mov_eax_NUM
1
40
24
mov_esi_NUM
lea_rdi_PTR
16
mov_edx_NUM
48
32
lea_rsi_PTR
mov_qword_SBP_rax
56
movzx_eax_byte_MEM
8
mov_edi_NUM
test_eax_eax
ret
mov_rdx_qword_SBP
add_rax_NUM
endbr64
mov_rax_qword_MEM
5
push_rbp
88
shl_rax_NUM
sub_rsp_NUM
64
movzx_edx_byte_MEM
mov_rax_qword_PTR
mov_rdx_rax
2
movzx_eax_al
4
72
mov_dword_SBP_NUM
or_rax_rdx
3
add_rax_rdx
test_rax_rax
mov_eax_dword_PTR
mov_rbp_rsp
mov_eax_dword_SBP
mov_rsi_rax
shl_rdx_NUM
call_qword_PTR
mov_qword_MEM_rax
movaps_xmmword_SBP_XMM
push_rbx
mov_qword_SBP_rdi
mov_qword_SSP_rax
pop_rbx
pop_rbp
cmp_eax_NUM
344
mov_dword_PTR_eax
add_rsp_NUM
lea_rdx_MEM
cmp_qword_SBP_NUM
mov_rcx_qword_SBP
mov_rdi_rdx
or_rdx_rax
mov_edx_dword_SBP
60
lea_rax_SBP
mov_qword_MEM_NUM
mov_qword_PTR_rax
call_rax
232
cmp_dword_SBP_NUM
mov_rdi_rbx
192
mov_rsi_rcx
184
28
mov_rsi_rbx
mov_rsi_rdx
6
80
leave
test_al_al
cmp_rax_NUM
216
cmp_al_NUM
mov_qword_SBP_rsi
mov_rax_qword_fs_MEM
mov_rbx_qword_MEM
xor_eax_eax
176
cdqe
lea_rax_PTR
mov_byte_MEM_NUM
mov_eax_dword_MEM
mov_rdx_qword_MEM
208
256
296
add_rdx_NUM
push_r12
lea_rbx_MEM
mov_rdi_qword_PTR
mov_rdi_rbp
nop
pop_r12
12
lea_rax_SSP
lea_rdi_MEM
mov_rdi_qword_MEM
mov_rsi_rbp
128
146
20
47
92
mov_edx_eax
mov_rcx_rax
test_rdi_rdi
lea_rdx_PTR
mov_ebx_NUM
mov_rdi_r12
160
200
mov_rdx_rbx
168
224
mov_qword_SBP_NUM
mov_rax_qword_SSP
mov_rcx_rdx
push_r13
240
shl_rsi_NUM
mov_rdi_r14
movaps_xmmword_SSP_XMM
pop_r13
112
248
96
cmp_qword_SBP_rax
lea_rdi_SBP
mov_dword_MEM_NUM
mov_dword_SBP_eax
mov_rcx_qword_MEM
mov_rcx_qword_PTR
mov_rdi_qword_SSP
push_r14
10
336
mov_qword_SSP_rdx
mov_r12_rax
mov_r14d_NUM
mov_rbx_rdi
pop_r14
push_r15
repne_scasb_al_byte_MEM
136
144
532
call_rcx
lea_rdi_SSP
mov_qword_SBP_rdx
mov_rbx_rax
mov_rsi_qword_SBP
movzx_eax_byte_PTR
movzx_edx_dl
pop_r15
xor_rax_qword_fs_MEM
264
add_qword_SBP_NUM
add_rdx_rcx
lea_rcx_MEM
lea_rdx_SBP
mov_qword_SBP_rcx
mov_qword_SSP_NUM
mov_r15d_NUM
mov_rdi_rcx
shl_rcx_NUM
test_edx_edx
152
280
312
320
and_eax_NUM
lea_rcx_PTR
mov_ebp_NUM
mov_edi_eax
mov_qword_MEM_rdx
mov_qword_SSP_rcx
mov_rbp_rax
mov_rsi_r13
mov_rsi_r14
sub_rax_rdx
288
68
add_dword_SBP_NUM
cmp_dword_SBP_eax
cmp_qword_MEM_NUM
mov_eax_eax
mov_ecx_dword_SBP
mov_r12_qword_SSP
mov_r14_qword_SSP
mov_rcx_qword_SSP
mov_rsi_qword_SSP
mov_rsi_r12
272
328
340
504
52
520
62
add_rbx_NUM
jmp_rax
mov_byte_MEM_dl
mov_esi_eax
mov_r13_qword_SSP
mov_r15d_dword_SSP
mov_rax_rdx
mov_rcx_NUM
mov_rdx_qword_PTR
movzx_eax_word_PTR
test_byte_MEM_NUM
xor_rcx_qword_fs_MEM
7
cmp_byte_MEM_NUM
cmp_edx_NUM
mov_edx_dword_MEM
mov_r12d_NUM
mov_rax_rcx
mov_rbp_rdi
mov_rdx_qword_SSP
mov_word_PTR_ax
104
204
304
360
552
cmp_ax_NUM
lea_r8_PTR
lea_rax_MEM
mov_dword_MEM_edx
mov_dword_SSP_NUM
mov_ecx_NUM
mov_qword_SBP_r8
mov_qword_SBP_r9
mov_qword_SSP_r8
mov_qword_SSP_r9
mov_rdx_r12
mov_rsi_r15
movzx_eax_ax
sub_eax_NUM
13
15
34
36
488
496
560
lea_r15_MEM
mov_dword_SBP_esi
mov_eax_dword_SSP
mov_qword_SSP_rsi
mov_r8d_NUM
mov_r9d_NUM
mov_rcx_rbx
mov_rdi_r15
mov_rsi_qword_MEM
sub_rax_NUM
test_rsi_rsi
11
124
39
58
add_edx_NUM
add_rax_qword_SSP
cmp_byte_SBP_NUM
cmp_edi_NUM
cmp_rax_qword_SBP
lea_rsi_MEM
mov_byte_SBP_al
mov_dword_SBP_edx
mov_ebx_dword_PTR
mov_ecx_ebx
mov_r13_rsi
mov_r14_rax
mov_r8_rcx
mov_rbp_rsi
mov_rbx_qword_SBP
mov_rbx_qword_SSP
mov_rdi_r13
mov_rdi_rsi
movzx_eax_word_MEM
not_eax
not_rax
or_dword_SBP_eax
push_rax
sub_rax_qword_SBP
180
368
564
84
add_eax_NUM
add_qword_SBP_rax
add_rbp_NUM
add_rbp_qword_SSP
cmp_byte_PTR_NUM
cmp_dword_MEM_NUM
cmp_edx_eax
cmp_esi_NUM
lea_eax_MEM
lea_edx_MEM
lea_rbp_PTR
mov_byte_MEM_al
mov_byte_PTR_al
mov_eax_edx
mov_ebx_esi
mov_edi_r12d
mov_edx_r14d
mov_esi_ebx
mov_r12_rdi
mov_r13d_NUM
mov_r14_qword_MEM
mov_r9_r14
mov_rax_r12
mov_rax_rbx
mov_rbp_qword_PTR
mov_rbp_rdx
mov_rbx_qword_PTR
mov_rcx_r12
mov_rcx_r13
mov_rcx_rbp
mov_rdx_r13
mov_rdx_r14
mov_rdx_rbp
movsx_eax_al
movsxd_rax_dword_MEM
movsxd_rdx_edx
movzx_edx_al
neg_rax
not_rdi
or_eax_edx
sete_al
shr_rsi_NUM
test_r14d_r14d
test_rbp_rbp
xor_rsi_qword_fs_MEM
120
181
228
324
44
528
add_rax_r15
add_rax_rcx
add_rcx_r9
add_rcx_rax
add_rdi_qword_MEM
add_rdx_rax
call_rdx
cmp_dl_NUM
cmp_ebx_NUM
cmp_qword_PTR_NUM
cmp_qword_SSP_NUM
cmp_r14d_NUM
cmp_rax_rdx
imul_rax_rdx
lea_r13_MEM
lea_rsi_SSP
mov_dword_MEM_eax
mov_dword_SBP_edi
mov_ebp_r14d
mov_ebx_eax
mov_ebx_edx
mov_ecx_dword_PTR
mov_ecx_edx
mov_ecx_r14d
mov_edi_edx
mov_qword_PTR_NUM
mov_qword_SSP_r14
mov_r13_NUM
mov_r14_rdi
mov_r14d_dword_PTR
mov_r15_qword_SSP
mov_r15_rdi
mov_r8_NUM
mov_r9_rax
mov_rax_r14
mov_rax_rdi
mov_rax_rsi
mov_rbp_qword_MEM
mov_rcx_r8
mov_rdi_qword_SBP
mov_rdx_rcx
mov_rdx_rsp
movzx_ecx_byte_MEM
movzx_edx_byte_SBP
not_rcx
or_r14d_eax
repe_cmpsb_byte_MEM
seta_al
shl_eax_NUM
sub_rax_r12
test_dl_dl
test_r15_r15
test_rbx_rbx
17
2000
220
25
332
384
472
512
53
568
57
63
65
add_dword_SSP_NUM
add_r12_rbx
add_rax_rbx
add_rbp_rbx
add_rcx_NUM
add_rdi_NUM
add_rdx_qword_SSP
add_rsi_rax
and_dword_PTR_eax
and_eax_edx
and_ecx_dword_PTR
and_rax_rdx
and_rdx_rax
and_rsp_NUM
call_qword_MEM
cmove_rax_rdx
cmp_byte_SSP_NUM
cmp_dword_PTR_NUM
cmp_eax_edx
cmp_ebp_NUM
cmp_ecx_dword_MEM
cmp_r12_rax
cmp_r12d_NUM
cmp_r13d_NUM
cmp_r14d_r12d
cmp_r15_rax
cmp_r15d_r14d
cmp_rax_rdi
cmp_rbp_rax
cmp_rbp_rbx
cmp_rcx_rax
imul_rax_qword_SBP
lea_ecx_MEM
lea_r12_PTR
lea_r15_PTR
lea_rdx_SSP
mov_byte_MEM_r13b
mov_byte_MEM_sil
mov_byte_PTR_NUM
mov_dword_MEM_ecx
mov_dword_PTR_edx
mov_eax_ebx
mov_eax_r14d
mov_ebp_esi
mov_ebp_r13d
mov_ebx_dword_SSP
mov_ebx_ebx
mov_ecx_dword_SSP
mov_ecx_r12d
mov_edi_dword_MEM
mov_edx_dword_PTR
mov_edx_esi
mov_edx_r15d
mov_esi_dword_PTR
mov_esi_dword_SBP
mov_esi_ebp
mov_esi_edx
mov_qword_MEM_rcx
mov_qword_PTR_rdx
mov_qword_SSP_r12
mov_qword_SSP_r13
mov_qword_SSP_r15
mov_qword_SSP_rdi
mov_r12_qword_PTR
mov_r12_r14
mov_r12d_dword_PTR
mov_r12d_edi
mov_r12d_r14d
mov_r13_rax
mov_r13d_ebx
mov_r13d_r14d
mov_r14_r12
mov_r14_rdx
mov_r14d_eax
mov_r15_rax
mov_r8d_eax
mov_r9_rdi
mov_r9_rdx
mov_rax_r15
mov_rax_rbp
mov_rcx_rsi
mov_rcx_rsp
movaps_xmmword_PTR_XMM
movdqa_XMM_xmmword_PTR
movsx_eax_byte_SBP
movsxd_rcx_ecx
movsxd_rsi_esi
movsxd_rsi_r13d
movzx_ebx_bl
movzx_ecx_al
movzx_r13d_byte_MEM
nop_dword_MEM
or_dword_PTR_eax
or_eax_dword_PTR
or_eax_dword_SBP
pop_rsi
push_rsp
sar_rax_NUM
sar_rbp_NUM
sar_rsi_NUM
sbb_al_NUM
sete_bl
shl_rdi_NUM
shr_qword_SBP_NUM
sub_dword_SBP_NUM
sub_qword_SBP_rax
sub_rbp_r15
sub_rcx_rdx
sub_rsi_rdi
test_cl_cl
xor_ah_NUM
xor_al_NUM
xor_ebp_ebp
xor_ebx_ebx
xor_rax_NUM
xor_rbx_qword_fs_MEM
127
1902
306
31
352
432
480
69
70
76
89
add_eax_edx
add_ebx_NUM
add_qword_MEM_NUM
add_qword_SSP_NUM
add_qword_SSP_rax
add_r12_NUM
add_r12_qword_SSP
add_r12_rax
add_r12_rbp
add_r13_NUM
add_r14_r12
add_r14_rbx
add_r14d_NUM
add_r15_NUM
add_r15_qword_MEM
add_rax_rdi
add_rax_rsi
add_rbx_rax
add_rsi_qword_MEM
add_rsi_rdi
and_dword_SBP_eax
and_eax_ecx
and_r13_NUM
and_rax_NUM
and_rax_qword_SSP
and_rbx_qword_SSP
and_rdx_qword_SSP
bt_r14_rax
btc_rax_NUM
call_r8
cmovae_rax_r14
cmovae_rax_rbx
cmovbe_rax_rcx
cmove_r8_rdx
cmovne_rax_rdx
cmovne_rbx_rdi
cmovne_rbx_rsi
cmp_cl_NUM
cmp_dword_MEM_ebx
cmp_eax_dword_MEM
cmp_eax_dword_SBP
cmp_eax_dword_SSP
cmp_ecx_NUM
cmp_qword_MEM_r13
cmp_qword_MEM_rax
cmp_qword_MEM_rbx
cmp_qword_SSP_rdi
cmp_r12_qword_SSP
cmp_r12b_NUM
cmp_r12d_r13d
cmp_r12d_r14d
cmp_r13_rcx
cmp_r14_qword_SSP
cmp_r14_r13
cmp_r14_rax
cmp_r14d_dword_MEM
cmp_rax_qword_SSP
cmp_rax_r13
cmp_rbp_NUM
cmp_rbp_r13
cmp_rbx_NUM
cmp_rbx_rax
cmp_rbx_rbp
cmp_rcx_r12
cmp_rdi_rax
cmp_rdx_rdi
div_qword_SBP
div_qword_SSP
imul_rax_r12
imul_rbp_r12_NUM
imul_rbx_rbp
imul_rdi_r12
jmp_rdx
lea_ebx_MEM
lea_edi_MEM
lea_r12_MEM
lea_r13_PTR
lea_r13_SBP
lea_r14_MEM
lea_r14_SSP
lea_rbp_MEM
lea_rbx_PTR
lea_rcx_SBP
lea_rsi_SBP
mov_byte_MEM_r15b
mov_byte_SSP_al
mov_dword_MEM_r12d
mov_dword_SBP_r8d
mov_dword_SBP_r9d
mov_dword_SSP_ebx
mov_dword_SSP_edi
mov_dword_SSP_r15d
mov_eax_r12d
mov_eax_r15d
mov_ebp_ecx
mov_ebx_r13d
mov_ecx_eax
mov_ecx_ebp
mov_ecx_r13d
mov_edi_dword_PTR
mov_edi_dword_SSP
mov_edi_r15d
mov_edx_dword_SSP
mov_edx_ebx
mov_edx_r12d
mov_qword_MEM_r15
mov_qword_MEM_rbp
mov_qword_PTR_rdi
mov_qword_SSP_rbp
mov_qword_SSP_rbx
mov_r10_qword_MEM
mov_r10_rdi
mov_r12_NUM
mov_r12_rsi
mov_r12d_eax
mov_r12d_r8d
mov_r13_r14
mov_r13d_dword_PTR
mov_r13d_ebp
mov_r13d_ecx
mov_r14_r15
mov_r14d_ebp
mov_r14d_ecx
mov_r14d_edx
mov_r14d_r13d
mov_r14d_r9d
mov_r15_qword_MEM
mov_r15_rdx
mov_r15_rsi
mov_r15d_edx
mov_r15d_esi
mov_r8_qword_MEM
mov_r8_qword_PTR
mov_r8_r13
mov_r8_rbx
mov_r8_rdx
mov_r8d_edi
mov_r9_rbx
mov_r9_rsi
mov_rax_r13
mov_rbp_r12
mov_rbx_rbp
mov_rbx_rcx
mov_rbx_rsi
mov_rcx_r14
mov_rdi_r10
mov_rdx_r15
mov_rdx_rdi
mov_rsi_NUM
mov_rsi_r10
mov_rsi_rsp
movabs_r14_NUM
movdqu_XMM_xmmword_MEM
movsx_r12d_al
movsx_r14d_r14b
movsxd_r12_ebx
movsxd_rdi_edi
movsxd_rdi_esi
movsxd_rdx_dword_MEM
movsxd_rdx_eax
movsxd_rsi_eax
movups_xmmword_MEM_XMM
movzx_ebx_al
movzx_edi_byte_SBP
movzx_edx_ax
movzx_edx_r12b
movzx_r12d_byte_PTR
movzx_r12d_word_PTR
movzx_r14d_byte_PTR
movzx_r14d_word_PTR
movzx_r15d_al
movzx_r15d_byte_MEM
movzx_r8d_bl
neg_rcx
not_ecx
not_rbx
not_rdx
or_ecx_dword_PTR
or_ecx_ebp
or_ecx_r14d
or_r15d_ebx
pop_rax
sbb_r14b_NUM
seta_r14b
setne_al
shl_dword_SBP_NUM
shl_dword_SSP_NUM
shl_edx_NUM
shl_r12_NUM
shl_rbp_NUM
shl_rbx_NUM
sub_dword_SSP_NUM
sub_eax_dword_SBP
sub_edi_NUM
sub_edx_ebx
sub_qword_SBP_NUM
sub_r13_r12
sub_r13_rax
sub_rax_r13
sub_rax_r14
sub_rax_rbp
sub_rbx_r12
sub_rdx_NUM
test_al_NUM
test_ebp_ebp
test_ebx_ebx
test_ecx_ecx
test_r10_r10
test_r12_r12
test_r13d_r13d
test_r15b_r15b
test_r15d_r15d
test_rdx_rdx
xor_eax_NUM
xor_rax_qword_SBP
